{"meta":{"title":"Hold These Truths with Dan Crenshaw","description":"Congressman Dan Crenshaw joins the world's leading experts for deep and insightful conversations about the most important issues facing us today.","subtitle":"","imageURL":"https://ssl-static.libsyn.com/p/assets/2/7/6/d/276d1e77486fbcbf/htt3.jpg","lastUpdated":"2020-05-19T20:22:43.000Z","link":"https://crenshaw.house.gov/","language":"en","author":"Dan Crenshaw","summary":"Congressman Dan Crenshaw joins the world's leading experts for deep and insightful conversations about the most important issues facing us today.","categories":["News","Politics"],"owner":{"name":"Dan Crenshaw","email":"danny.walden@mail.house.gov"},"explicit":false},"episodes":[{"title":"Why Does Reopening Polarize Republicans and Democrats?","description":"<p>On this solo episode, Dan expands on his recently published oped for The Wall Street Journal to ponder the question, “Why do Democrats want to keep us shutdown and Republicans want us free to reopen?” The answer is part politics, part psychology.</p> <p>Read the oped here: https://www.wsj.com/articles/why-does-reopening-polarize-us-11589842995</p>","subtitle":"On this solo episode, Dan expands on his recently published oped for The Wall Street Journal to ponder the question, “Why do Democrats want to keep us shutdown and Republicans want us free to reopen?” The answer is part politics, part psychology....","imageURL":"https://ssl-static.libsyn.com/p/assets/d/5/4/f/d54f8f834c1fd24d/htt3.jpg","pubDate":"2020-05-19T20:17:34.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/why-does-reopening-polarize-republicans-and-democrats","enclosure":{"length":"39965149","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/62_Why_Does_Reopening_Polarize_Republicans_and_Democrats.mp3?dest-id=1849868"},"duration":2467,"explicit":false},{"title":"China: Global Domination, the New Silk Road, & the Return of History, with Ambassador Jon Huntsman, Jr.","description":"<p>Jon Huntsman returns to the podcast to talk China and what he learned as Ambassador to America’s greatest trading partner and emerging rival. For the first time in centuries, China is a leader on the world stage. So how do Xi Jinping and the Chinese Communist Party view their role as a global player? What moves are they making to change the geopolitical landscape across Asia and Europe? What is their endgame with the United States – and how should we react?</p> <p>Jon Huntsman is the only ambassador to ever serve in both China (2009 – 2011) and Russia (2017 – 2019). He was the Governor of Utah (Jan. 2005 – Aug. 2009), served as the Chair of the Western Governors Association, and under his leadership Utah was ranked as the best managed state in America by Pew Center on the States.</p>","subtitle":"Jon Huntsman returns to the podcast to talk China and what he learned as Ambassador to America’s greatest trading partner and emerging rival. For the first time in centuries, China is a leader on the world stage. So how do Xi Jinping and the Chinese...","imageURL":"https://ssl-static.libsyn.com/p/assets/1/5/6/6/15668052967d4656/htt3.jpg","pubDate":"2020-05-17T10:35:10.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/china-global-domination-the-new-silk-road-the-return-of-history-with-ambassador-jon-huntsman","enclosure":{"length":"47999348","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/61_Jon_Huntsman_on_China.mp3?dest-id=1849868"},"duration":2969,"explicit":false},{"title":"$3 Trillion of Virtue Signaling","description":"<p>In this solo episode, Dan breaks down the Democrats' $3 trillion, 1800 page spending bill which was voted on by the House on Friday, May 15.</p>","subtitle":"In this solo episode, Dan breaks down the Democrats' $3 trillion, 1800 page spending bill which was voted on by the House on Friday, May 15.","imageURL":"https://ssl-static.libsyn.com/p/assets/c/e/7/2/ce720fbb1cfdb049/htt3.jpg","pubDate":"2020-05-15T23:13:18.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/3-trillion-of-virtue-signaling-0","enclosure":{"length":"32074919","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/3_trillion_of_virtue_signaling.mp3?dest-id=1849868"},"duration":1974,"explicit":false},{"title":"Russia: Spies, Disinformation Campaigns, and the Rise of Putinism, with Ambassador Jon Huntsman, Jr.","description":"<p>Jon Huntsman, Jr. served as U.S. Ambassador to Russia from 2017 – 2019, during one of the most difficult periods in bilateral relationships since deep in the Cold War.  He joined Dan to break down the complex foreign policy issues involving the two countries.  What’s the truth behind the Michael Flynn investigation and what would an actual Russian intelligence operation look like? How does the average Russian view America and their own country’s place in the world? Why has Vladimir Putin’s persona become so deeply entwined with their cultural identity? What is Putin’s worldview – is he Peter the Great or Ivan the Terrible – and what can we expect to happen to Russia when he does exit the stage?</p> <p>Jon Huntsman is the only ambassador to ever serve in both China (2009 – 2011) and Russia (2017 – 2019), as well as Singapore (1992 – 1993). He was the Governor of Utah (Jan. 2005 – Aug. 2009), served as the Chair of the Western Governors Association, and under his leadership Utah was ranked as the best managed state in America by Pew Center on the States.</p>","subtitle":"Jon Huntsman, Jr. served as U.S. Ambassador to Russia from 2017 – 2019, during one of the most difficult periods in bilateral relationships since deep in the Cold War.  He joined Dan to break down the complex foreign policy issues involving the...","imageURL":"https://ssl-static.libsyn.com/p/assets/2/6/7/1/26713621245277c2/htt3.jpg","pubDate":"2020-05-15T12:29:11.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/russia-spies-disinformation-campaigns-and-the-rise-of-putinism-with-ambassador-jon-huntsman-jr","enclosure":{"length":"49089241","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/59_Jon_Huntsman_on_Russia.mp3?dest-id=1849868"},"duration":3037,"explicit":false},{"title":"Turning Point, Political Persuasion, and the Issue Every Young Person Should Care Most About, with Charlie Kirk","description":"<p>Why are so many young people motivated to join the far left? Charlie Kirk talks with Dan about the shallow yet persuasive arguments used by leaders like AOC and Bernie to win over the millennial/z generations, and the best ways to counter them. What's the one issue young people disregard which matters most to their futures? How is the progressive movement doing on college campuses these days? Charlie and Dan dive into these questions and give advice every young person should know before they venture into politics.</p> <p>Charlie Kirk is the Founder of Turning Point USA, host of The Charlie Kirk Show, and author of \"The MAGA Doctrine.\" Follow him on Twitter at @charliekirk11.</p>","subtitle":"Why are so many young people motivated to join the far left? Charlie Kirk talks with Dan about the shallow yet persuasive arguments used by leaders like AOC and Bernie to win over the millennial/z generations, and the best ways to counter them. What's...","imageURL":"https://ssl-static.libsyn.com/p/assets/6/b/4/6/6b46bd37ba4577e5/htt3.jpg","pubDate":"2020-05-10T20:10:15.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/turning-point-political-persuasion-and-the-issue-every-young-person-should-care-most-about-with-charlie-kirk","enclosure":{"length":"46802467","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/58_Charlie_Kirk.mp3?dest-id=1849868"},"duration":2895,"explicit":false},{"title":"Saving the American Economy, with Dr. John Diamond","description":"<p>Economist Dr. John Diamond joins Dan to examine the current state of the American economy and what’s on the horizon for businesses and labor markets. What’s working and not working with the CARES Act? How does an extended duration for unemployment relief slow the recovery even further? Are we close to reaching the crisis point with longer-term structural issues like entitlement programs, budget deficits, and government debt?</p> <p>Dr. John Diamond is a professor and director of the Center for Public Finance at the Baker Institute, an adjunct professor of economics at Rice University and CEO of Tax Policy Advisers, LLC. His research interests are federal tax and expenditure policy, state and local public finance, tax reform and other policy issues. Follow him on Twitter at @jw_diamond.</p>","subtitle":"Economist Dr. John Diamond joins Dan to examine the current state of the American economy and what’s on the horizon for businesses and labor markets. What’s working and not working with the CARES Act? How does an extended duration for unemployment...","imageURL":"https://ssl-static.libsyn.com/p/assets/4/7/d/9/47d90e5d0e5a1bfd/htt3.jpg","pubDate":"2020-05-09T15:25:40.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/saving-the-american-economy-with-dr-john-diamond","enclosure":{"length":"60212016","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/57_John_Diamond.mp3?dest-id=1849868"},"duration":3733,"explicit":false},{"title":"Unreasonable and Unjust Laws in the Age of COVID-19, with Heritage Foundation’s Kay Coles James","description":"<p>Kay Coles James is President of Heritage Foundation and leads the National Coronavirus Recovery Commission, an independent panel that works closely with the White House and congressional leaders to provide recommendations for the plan moving forward to protect the lives and livelihoods of Americans.</p> <p>What looming threats to economic freedom and liberty do we see beginning to play out across America and how can we stop them? What actions need to be taken at the federal, state, and local levels of government to get America back on track? How can private individuals and institutions take ownership of the recovery process? Kay brings decades of experience in public service to create a blueprint for restoring the American economy while also protecting public health and individual freedom.</p> <p>Learn more about the National Coronavirus Recovery Commission’s recommendations at www.coronaviruscommission.com.</p>","subtitle":"Kay Coles James is President of Heritage Foundation and leads the National Coronavirus Recovery Commission, an independent panel that works closely with the White House and congressional leaders to provide recommendations for the plan moving forward...","imageURL":"https://ssl-static.libsyn.com/p/assets/c/d/a/b/cdab34190acbed02/htt3.jpg","pubDate":"2020-05-06T20:58:20.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/unreasonable-and-unjust-laws-in-the-age-of-covid-19-with-heritage-foundations-kay-coles-james","enclosure":{"length":"45793718","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/56_Kay_Coles_James.mp3?dest-id=1849868"},"duration":2831,"explicit":false},{"title":"Iraq: Aftermath of Retreat, ISIS, and the Iranian Threat, with Steven Nabil","description":"<p>Steven Nabil is a journalist with extensive experience covering Iraqi politics and security. He joined Dan to examine the current state of Iraq and its long conflict with Iran. What has become of ISIS? How effective was the Soleimani strike at disrupting Iranian operations in Iraq, and what does this tell us about Iran’s military power structure? What should we make of the ongoing Iraqi protests? Is it a movement toward peace and democracy or further terror across the region?</p> <p>Follow Steven Nabil on Twitter at @thestevennabil.</p>","subtitle":"Steven Nabil is a journalist with extensive experience covering Iraqi politics and security. He joined Dan to examine the current state of Iraq and its long conflict with Iran. What has become of ISIS? How effective was the Soleimani strike at...","imageURL":"https://ssl-static.libsyn.com/p/assets/b/9/e/1/b9e18e061f3470fe/htt3.jpg","pubDate":"2020-05-04T16:16:35.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/iraq-aftermath-of-retreat-isis-and-the-iranian-threat-with-steven-nabil","enclosure":{"length":"68435215","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/55_Steven_Nabil.mp3?dest-id=1849868"},"duration":4247,"explicit":false},{"title":"The City of David at the Intersection of Faith, History, and Geopolitics, with Ze’ev Orenstein","description":"<p>On this very special episode, Dan brings listeners into the historic site of Biblical Jerusalem, the City of David, to discover the cultural, political, and spiritual connections this once lost city has with our world today. How was the City of David lost and then rediscovered? What major discoveries have archaeologists recently made that link back to the times of Jesus and King David? What are the important geopolitical implications for this site which is at the heart of a city under constant threat from Palestinian terrorism?</p> <p>Our guide is Ze’ev Orenstein, the Director of International Affairs at the City of David Foundation. Learn more at  https://www.cityofdavid.org.il/en</p>","subtitle":"On this very special episode, Dan brings listeners into the historic site of Biblical Jerusalem, the City of David, to discover the cultural, political, and spiritual connections this once lost city has with our world today. How was the City of David...","imageURL":"https://ssl-static.libsyn.com/p/assets/3/9/d/c/39dcd511aa4c7c0b/htt3.jpg","pubDate":"2020-05-03T14:00:45.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-city-of-david-at-the-intersection-of-faith-history-and-geopolitics-with-zeev-orenstein-0","enclosure":{"length":"52524744","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/54_Zeev_Orenstein.mp3?dest-id=1849868"},"duration":3252,"explicit":false},{"title":"Skin in the Game - Personal Responsibility in American Health Care, with Dr. Nicole Saphier","description":"<p>Dr. Nicole Saphier, physician and author of “Make America Healthy Again,” joins Dan to examine the current state of the American health care system and the path to making it more accessible for everyone. Why is there a disconnect between the growing prevalence of preventable diseases in America and the culture of healthy diets and exercise which is projected on social media? Is there a difference between health care access and rights? What does the race to develop a cure for COVID-19 tell us about the rising cost of health care? Is there a practical middle ground between government-run and free market systems? Medicaid, the Affordable Care Act, rising cancer rates among millennials, and the opioid crisis are all examined in depth, along with practical ways for individuals to take ownership of their own health and well being. Follow Dr. Saphier on Twitter at <span class= \"css-901oao css-16my406 r-1qd0xha r-ad9z0x r-bcqeeo r-qvutc0\">@NBSaphierMD.</span></p>","subtitle":"Dr. Nicole Saphier, physician and author of “Make America Healthy Again,” joins Dan to examine the current state of the American health care system and the path to making it more accessible for everyone. Why is there a disconnect between the...","imageURL":"https://ssl-static.libsyn.com/p/assets/a/f/e/1/afe10b1bd8d7c996/htt3.jpg","pubDate":"2020-05-01T22:32:30.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/skin-in-the-game-personal-responsibility-in-american-health-care-with-dr-nicole-saphier","enclosure":{"length":"73308486","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/53_Nicole_Saphier.mp3?dest-id=1849868"},"duration":4551,"explicit":false},{"title":"Iran: COVID-19, Nukes, and Terrorists, with Behnam Ben Taleblu","description":"<p>With everyone in America so focused on dealing with the hardships brought on by the economic shutdown, it is easy to miss the disaster unfolding in Iran at the hands of their totalitarian regime. What role has China played in causing Iran to become the epicenter of the coronavirus outbreak in the Middle East? How do the Iranian people view the regime’s handling of the crisis? What is the state of the Iranian regime five months out from the Soleimani strike?</p> <p>Behnam Ben Taleblu is a senior fellow at the Foundation for Defense of Democracies, a non-partisan research institute focusing on foreign policy and national security, where he focuses on Iranian security and political issues. Behnam has authored or coauthored articles appearing in Foreign Affairs, Foreign Policy, Fox News, The Hill, and The National Interest. Follow Foundation for Defense of Democracies on Twitter at @FDD.</p>","subtitle":"With everyone in America so focused on dealing with the hardships brought on by the economic shutdown, it is easy to miss the disaster unfolding in Iran at the hands of their totalitarian regime. What role has China played in causing Iran to become...","imageURL":"https://ssl-static.libsyn.com/p/assets/7/b/8/d/7b8d913c7efb6464/htt3.jpg","pubDate":"2020-04-30T18:50:41.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/iran-covid-19-nukes-and-terrorists-with-behnam-ben-taleblu","enclosure":{"length":"49899808","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/52_Benham_Ben_Taleblu.mp3?dest-id=1849868"},"duration":3088,"explicit":false},{"title":"American Cities in the Age of COVID-19, with Dr. Edward Glaeser","description":"<p>Harvard University’s Dr. Edward Glaeser joins Dan to examine the implications of COVID-19 on the economics of American cities. Why has the role of cities in battling pandemics changed dramatically over the past century? Will urban or rural communities recover more quickly after the economic shutdown ends? What is the best way to reduce the economic harm to workers who lost their incomes because of the shutdown? Should cities approach their housing and infrastructure policies differently going forward? Dr. Glaeser also sheds light on the more fundamental question of why cities exist in the first place.</p> <p>Dr. Edward Glaeser is the Fred and Eleanor Glimp Professor of Economics in the Faculty of Arts and Sciences at Harvard University. He has published dozens of papers on the growth, law, and economics of cities. His work is focused on the determinants of city growth and the role of cities as centers of idea transmission. He received his PhD from the University of Chicago.</p>","subtitle":"Harvard University’s Dr. Edward Glaeser joins Dan to examine the implications of COVID-19 on the economics of American cities. Why has the role of cities in battling pandemics changed dramatically over the past century? Will urban or rural...","imageURL":"https://ssl-static.libsyn.com/p/assets/5/d/3/b/5d3b5368dfc5a9a6/htt3.jpg","pubDate":"2020-04-29T17:46:14.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/american-cities-in-the-age-of-covid-19-with-dr-edward-glaeser","enclosure":{"length":"68329605","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/51_Dr._Ed_Glaeser.mp3?dest-id=1849868"},"duration":4240,"explicit":false},{"title":"From Woke to Awake - Inside the Mind of Dave Rubin","description":"<p>On this episode we dive right into the mind of Dave Rubin. How did Dave evolve from being a “woke” leftist to a free thinking defender of individual rights and limited government? What’s the difference between old school liberals and the progressive left that dominates the Democratic Party today? From starting out as a comedian struggling to make it in New York City, to the epiphany he had about the far left and outrage culture while working with the Young Turks, and now as the host of The Rubin Report and author of “Don’t Burn This Book: Thinking for Yourself in the Age of Unreason” - Dave has developed deep, fascinating insights into the motivations of the far left and their governing principles - or lack thereof.</p>","subtitle":"On this episode we dive right into the mind of Dave Rubin. How did Dave evolve from being a “woke” leftist to a free thinking defender of individual rights and limited government? What’s the difference between old school liberals and the...","imageURL":"https://ssl-static.libsyn.com/p/assets/2/4/0/d/240dd2be31439f05/htt3.jpg","pubDate":"2020-04-28T15:58:33.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/from-woke-to-awake-inside-the-mind-of-dave-rubin","enclosure":{"length":"60651530","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/50_Dave_Rubin.mp3?dest-id=1849868"},"duration":3760,"explicit":false},{"title":"On the Front Line of the Battle Against COVID-19, with HHS Deputy Secretary Eric Hargan","description":"<p>Eric Hargan is the Deputy Secretary of Health and Human Services and is responsible for overseeing the day-to-day operations and management of the department in addition to leading policy and strategy development. What does it actually takes to develop a test for a new virus like COVID-19? What’s the strategy for implementing nationwide testing? How are HHS regulations evolving to enable telehealth? Eric joined Dan to answer these questions and more.</p>","subtitle":"Eric Hargan is the Deputy Secretary of Health and Human Services and is responsible for overseeing the day-to-day operations and management of the department in addition to leading policy and strategy development. What does it actually takes to...","imageURL":"https://ssl-static.libsyn.com/p/assets/4/e/0/e/4e0e43059994f3c3/htt3.jpg","pubDate":"2020-04-27T14:46:27.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/on-the-front-line-of-the-battle-against-covid-19-with-hhs-deputy-secretary-eric-hargan","enclosure":{"length":"48221405","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/49_Eric_Hargan.mp3?dest-id=1849868"},"duration":2983,"explicit":false},{"title":"From Survivor to Leader: Courtney Litvak’s Journey to End the Scourge of Human Trafficking","description":"<p>Courtney Litvak was a junior in high school when her life took a downward spiral into the world of drugs and sex trafficking. With help from her faith and family, she pulled herself out of that world and dedicated her life to educating and supporting families who are affected by this crime. On April 24th, Courtney was appointed by President Trump to serve on the U.S. Advisory Council on Human Trafficking.</p> <p>Courtney joined Dan to talk about her journey, explain how sex traffickers target their victims, and the red flags to watch out for. Courtney debunks all the stereotypes about sex trafficking that we see in movies like Taken. The truth is it is a crime which can happen in any neighborhood, anywhere in America.</p> <p>Courtney Litvak serves as Ambassador to Childproof America, an organization which empowers families in the battle against sex trafficking. Learn more at www.childproofamerica.org.</p>","subtitle":"Courtney Litvak was a junior in high school when her life took a downward spiral into the world of drugs and sex trafficking. With help from her faith and family, she pulled herself out of that world and dedicated her life to educating and supporting...","imageURL":"https://ssl-static.libsyn.com/p/assets/3/a/3/6/3a361c57e6c5ded7/htt3.jpg","pubDate":"2020-04-26T20:47:18.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/from-survivor-to-leader-courtney-litvaks-journey-to-end-the-scourge-of-human-trafficking","enclosure":{"length":"31844231","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/48_Courtney_Litvak.mp3?dest-id=1849868"},"duration":1960,"explicit":false},{"title":"\"A Rising Tide Lifts All Boats\": The Economics of Human Flourishing Amidst a Pandemic, with Dr. Russ Roberts","description":"<p>While considerations of health are of the utmost importance during a pandemic, they may not tell the full story. Millions of Americans face increasing economic challenges in the face of COVID-19, and questions are looming as how best to respond. In this episode,  Dr. Russ Roberts of the Hoover Institution and Rep. Crenshaw discuss the current economic crisis, as well as past economic struggles. What constitutes human flourishing and truly \"living\"? Do our usual economic metrics take into account the \"intangibles\" or rather, those factors which are not traditionally quantified? Which economic policies would make the most sense right now, given the relatively unknown nature of this pandemic? How have long-standing, warped incentives within the healthcare industry contributed to our current supply chain woes? Dr. Roberts answers these questions, as well as a host of others. </p> <p>Dr. Russ Roberts is a Fellow at Stanford University’s Hoover Institution and hosts the weekly podcast EconTalk.  He has written extensively, including his latest book Gambling With Other People’s Money: How Perverse Incentives Caused the Financial Crisis, which examines the role that historical bailouts played in fueling the 2008 crisis. He has taught at George Mason University, Washington University in St. Louis, University of Rochester, Stanford University, and UCLA. Dr. Roberts earned his PhD from the University of Chicago and his undergraduate degree in economics from the University of North Carolina at Chapel Hill.</p>","subtitle":"While considerations of health are of the utmost importance during a pandemic, they may not tell the full story. Millions of Americans face increasing economic challenges in the face of COVID-19, and questions are looming as how best to respond....","imageURL":"https://ssl-static.libsyn.com/p/assets/9/b/b/a/9bba8c7d8e423767/htt3.jpg","pubDate":"2020-04-24T23:41:53.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/a-rising-tide-lifts-all-boats-the-economics-of-human-flourishing-amidst-a-pandemic-with-dr-russ-roberts","enclosure":{"length":"64416853","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/47_Russ_Roberts.mp3?dest-id=1849868"},"duration":3995,"explicit":false},{"title":"Why Was Small Business Relief Delayed (Again)? Behind the Scenes with House GOP Leader Kevin McCarthy","description":"<p>House Republican Leader Kevin McCarthy joined Dan to give a behind the scenes look at the negotiations surrounding the latest coronavirus relief package and to detail how Speaker Nancy Pelosi was responsible for needless delay once again. We asked Speaker Pelosi to join this podcast to offer the Democrat side of the story but the Speaker was not available. She has an open invitation.</p>","subtitle":"House Republican Leader Kevin McCarthy joined Dan to give a behind the scenes look at the negotiations surrounding the latest coronavirus relief package and to detail how Speaker Nancy Pelosi was responsible for needless delay once again. We asked...","imageURL":"https://ssl-static.libsyn.com/p/assets/0/6/a/1/06a1806f552e90da/htt3.jpg","pubDate":"2020-04-23T21:53:43.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/why-was-small-business-relief-delayed-again-behind-the-scenes-with-house-gop-leader-kevin-mccarthy","enclosure":{"length":"26605600","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/46_Kevin_McCarthy.mp3?dest-id=1849868"},"duration":1632,"explicit":false},{"title":"The Creator of Dilbert Talks Persuasion, Hypnosis, and Living in the Matrix - with Scott Adams","description":"<p>How do you change the minds of your political opponents? Scott Adams knows. He has spent a lifetime studying psychology and persuasion to gain advantages in fields as diverse as banking, cartooning, writing, and even hypnosis. Scott joined Dan for a fascinating conversation about the differences between how Republicans and Democrats think, the top persuasion techniques you can start using immediately, and what coronavirus is teaching us about human motivations and decision-making.</p> <p>Scott Adams is the creator of the comic strip “Dilbert” and author of “Loserthink - How Untrained Brains Are Ruining America.” Follow him on Twitter at @ScottAdamsSays.</p>","subtitle":"How do you change the minds of your political opponents? Scott Adams knows. He has spent a lifetime studying psychology and persuasion to gain advantages in fields as diverse as banking, cartooning, writing, and even hypnosis. Scott joined Dan for a...","imageURL":"https://ssl-static.libsyn.com/p/assets/b/0/5/7/b0576b78368a7013/htt3.jpg","pubDate":"2020-04-22T16:18:04.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-creator-of-dilbert-talks-persuasion-hypnosis-and-living-in-the-matrix-with-scott-adams","enclosure":{"length":"76513026","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/45_Scott_Adams.mp3?dest-id=1849868"},"duration":4751,"explicit":false},{"title":"How Medicare for All Would Make America’s Coronavirus Response Worse, with Chris Jacobs","description":"<p>What would America’s response to the coronavirus pandemic look like under a Medicare for All/single payer system? Could we have responded to the crisis faster? Would we have the health care capacity (doctors, hospitals, equipment) to meet the demands of patients? How does our response compare to other countries which do have single payer systems?</p> <p>Chris Jacobs, author of “The Case Against Single Payer,” returns to the podcast to examine the Democrats' claims that our country would be better off with Medicare for All, or even Joe Biden’s expanded buy-in version, during the COVID-19 crisis.</p> <p>Chris Jacobs is founder and CEO of Juniper Research Group. Follow him on Twitter at @chrisjacobsHC.</p>","subtitle":"What would America’s response to the coronavirus pandemic look like under a Medicare for All/single payer system? Could we have responded to the crisis faster? Would we have the health care capacity (doctors, hospitals, equipment) to meet the...","imageURL":"https://ssl-static.libsyn.com/p/assets/3/d/3/8/3d38cd647266aee2/htt3.jpg","pubDate":"2020-04-20T21:18:54.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/how-medicare-for-all-would-make-americas-coronavirus-response-worse-with-chris-jacobs","enclosure":{"length":"51460624","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/44_Chris_Jacobs.mp3?dest-id=1849868"},"duration":3186,"explicit":false},{"title":"Fair Trading with China, the Truth About the Lockdowns, and the Economics of Recycling, with Peter Huntsman","description":"<p>As CEO of Huntsman Corp., a multinational chemicals and plastics manufacturer, Peter Huntsman understands exactly how our global supply chains are intertwined with our foreign policy. Peter joins Dan to talk about China, and how to deal with America’s largest trading partner and adversary. He also shares in-depth knowledge on the real cost of recycling, and Dan offers a thought experiment for how cities should choose when to lift their lockdowns.</p> <p>Mr. Huntsman is also the Chairman and CEO of the Huntsman Cancer Foundation, which raises funds for and supports the ongoing research, treatment and educational programs of the world-renowned Huntsman Cancer Institute. He is also CEO of the Huntsman Foundation, which, most recently, committed $150 million to the University of Utah to establish the Huntsman Mental Health Institute, which is expected to become a nationally-recognized leader in mental health research, care, education and community outreach.</p>","subtitle":"As CEO of Huntsman Corp., a multinational chemicals and plastics manufacturer, Peter Huntsman understands exactly how our global supply chains are intertwined with our foreign policy. Peter joins Dan to talk about China, and how to deal with...","imageURL":"https://ssl-static.libsyn.com/p/assets/a/d/d/a/addaf00ea339f028/htt3.jpg","pubDate":"2020-04-19T15:04:28.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/fair-trading-with-china-the-truth-about-the-lockdowns-and-the-economics-of-recycling-with-peter-huntsman","enclosure":{"length":"61423587","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/43_Peter_Huntsman.mp3?dest-id=1849868"},"duration":3808,"explicit":false},{"title":"“The Lost Month of February” - How the Media is Rewriting History","description":"<p>In this quick episode, Dan gives the information you need to know to fire back at the left wing media’s latest talking points which claim that the White House’s coronavirus response in February is the reason our nation is suffering so much today.</p>","subtitle":"In this quick episode, Dan gives the information you need to know to fire back at the left wing media’s latest talking points which claim that the White House’s coronavirus response in February is the reason our nation is suffering so much today.","imageURL":"https://ssl-static.libsyn.com/p/assets/8/1/4/5/8145027ed5255e12/htt3.jpg","pubDate":"2020-04-17T21:15:04.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-lost-month-of-february-how-the-media-is-rewriting-history","enclosure":{"length":"17007589","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/42_The_Lost_Month_of_February.mp3?dest-id=1849868"},"duration":1032,"explicit":false},{"title":"Q&A EPISODE: COVID-19 Strategy, Socialized Medicine, Glass Eyes, and More","description":"<p>Dan returns for another solo episode to answer your questions. What should Phase 2 of America’s coronavirus response look like? What about the next “stimulus package?” Productivity tips while you’re stuck in lockdown? How do glass eyes work? All that and much more!</p> <p>Send your questions for the next Q&A episode to @RepDanCrenshaw on Twitter or via our website www.crenshaw.house.gov.</p>","subtitle":"Dan returns for another solo episode to answer your questions. What should Phase 2 of America’s coronavirus response look like? What about the next “stimulus package?” Productivity tips while you’re stuck in lockdown? How do glass eyes work?...","imageURL":"https://ssl-static.libsyn.com/p/assets/d/a/d/1/dad1c67f49775bc1/htt3.jpg","pubDate":"2020-04-15T23:23:22.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/qa-episode-covid-19-strategy-socialized-medicine-glass-eyes-and-more","enclosure":{"length":"40760857","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/41_QA_2.mp3?dest-id=1849868"},"duration":2517,"explicit":false},{"title":"America Divided: A Nation Polarized in Politics and Pandemic, with Dr. Frank Luntz","description":"<p>Dr. Frank Luntz ran his first focus group in 1988 and ever since then he has made it his life’s work to understand how people think and behave. That knowledge has never been more relevant than it is today as Americans become increasingly divided over politics and now even the response to COVID-19. Dr. Luntz joined Dan for a fascinating conversation about how we got to this point and what it takes to fix it.</p> <p>Dr. Luntz has written, supervised, and conducted more than 2,500 surveys, focus groups, ad tests, and dial sessions in more than two dozen countries on six continents over the past 20 years. His political knowledge and skills are recognized globally, and he has served as an election consultant and commentator in Canada, Britain, Ireland, Germany, Austria, the Netherlands, Australia, Venezuela, and Ukraine. He has been a guest on virtually every talk show in America, including multiple appearances on The Daily Show and Real Time with Bill Maher, as well as 60 Minutes, Good Morning America, Meet the Press, Nightline, The Today Show, the PBS News Hour, and Face the Nation.</p>","subtitle":"Dr. Frank Luntz ran his first focus group in 1988 and ever since then he has made it his life’s work to understand how people think and behave. That knowledge has never been more relevant than it is today as Americans become increasingly divided...","imageURL":"https://ssl-static.libsyn.com/p/assets/b/c/b/9/bcb908acca0df6c0/htt3.jpg","pubDate":"2020-04-15T01:11:15.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/america-divided-a-nation-polarized-in-politics-and-pandemic-with-dr-frank-luntz","enclosure":{"length":"34016329","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/40_Frank_Luntz.mp3?dest-id=1849868"},"duration":2095,"explicit":false},{"title":"Federal vs Local Control - Balancing Responsibilities During Crisis, with Judge Ed Emmett","description":"<p>Every American city is different in terms of its transportation infrastructure and population density, two variables (among many others) which have major implications for the spread of COVID-19. So to what extent should the response to this crisis be handled by the federal government vs state and local governments? Former County Judge Ed Emmett, who led the recovery efforts after Hurricane Harvey hit the Houston area in 2017, joins Dan to examine this complicated question and talk about the urgent need for governments to begin looking ahead to re-opening the economy and allowing Americans to get back to work.</p> <p>Judge Emmett is an expert in emergency management at the local level, serving for almost 12 years as the County Judge for Harris County - the third most populous county in the country. He currently serves as a professor of public policy at The Kinder Institute for Urban Research at Rice University.</p>","subtitle":"Every American city is different in terms of its transportation infrastructure and population density, two variables (among many others) which have major implications for the spread of COVID-19. So to what extent should the response to this crisis be...","imageURL":"https://ssl-static.libsyn.com/p/assets/4/b/c/f/4bcffbd67aa35c0b/htt3.jpg","pubDate":"2020-04-13T16:37:02.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/federal-vs-local-control-balancing-responsibilities-during-crisis-with-judge-ed-emmett","enclosure":{"length":"54428098","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/39_Ed_Emmett.mp3?dest-id=1849868"},"duration":3371,"explicit":false},{"title":"Perspectives on American Media, with Dana Perino","description":"<p>Dana Perino has a unique perspective of American journalism, having served on both sides of the pulpit - first as press secretary under President George W. Bush and now as the anchor of The Daily Briefing and co-host of The Five on Fox News. Dana joined Dan to talk about the coronavirus coverage, the media’s crisis of credibility, and what she learned as press secretary in the White House.</p>","subtitle":"Dana Perino has a unique perspective of American journalism, having served on both sides of the pulpit - first as press secretary under President George W. Bush and now as the anchor of The Daily Briefing and co-host of The Five on Fox News. Dana...","imageURL":"https://ssl-static.libsyn.com/p/assets/3/4/c/2/34c2ffa52d451981/htt3.jpg","pubDate":"2020-04-10T23:53:26.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/perspectives-on-american-media-with-dana-perino","enclosure":{"length":"51386676","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/38_Dana_Perino.mp3?dest-id=1849868"},"duration":3181,"explicit":false},{"title":"Helping Restaurant Workers in the Fallout from COVID-19, with Chris Shepherd","description":"<p>The restaurant industry is in deep pain right now and the future looks very uncertain. Dan spoke with Chris Shepherd, award winning chef and owner of four Houston restaurants that employed 200 people before the shutdown, to learn about the creative approaches his business has taken to weather the crisis. Chris explains the tough economics of running a restaurant, policy ideas that would help businesses like his survive the shutdown, and the most effective ways to support your local restaurants and their employees during this crisis.</p> <p>Chris Shepherd’s charitable foundation ‘Southern Smoke’ has donated more than $2 million to those in the food and beverage industry in crisis and to the National MS Society. In 2014 he won the James Beard Award for Best Chef in the Southwest for his contributions to the incredibly diverse Houston culinary scene.</p>","subtitle":"The restaurant industry is in deep pain right now and the future looks very uncertain. Dan spoke with Chris Shepherd, award winning chef and owner of four Houston restaurants that employed 200 people before the shutdown, to learn about the creative...","imageURL":"https://ssl-static.libsyn.com/p/assets/c/d/9/6/cd961a86a91e02ac/htt3.jpg","pubDate":"2020-04-08T21:53:08.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/helping-restaurant-workers-in-the-fallout-from-covid-19-with-chris-shepherd","enclosure":{"length":"31221108","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/37_Chris_Shepherd.mp3?dest-id=1849868"},"duration":1921,"explicit":false},{"title":"Mobilize and Transition: A Policy to Defeat COVID-19 and Restore America, with Dr. Danielle Allen","description":"<p>A binary choice is often given in the conversations about the right pathway to defeat the coronavirus: we must prioritize lives over the economy or the economy over lives. Political theorist Dr. Danielle Allen joins Dan to describe a third pathway - treating the virus as a major national security threat and aggressively building an infrastructure for fighting and surviving the pandemic. A wartime mentality that shifts our economy to the production of testing capacity and test administration, personal protective equipment, and tools for case identification and contact tracing.</p> <p>Dr. Danielle Allen, James Bryant Conant University Professor at Harvard University, and Director of Harvard’s Edmond J. Safra Center for Ethics, is a political theorist who has published broadly in democratic theory, political sociology, and the history of political thought. Widely known for her work on justice and citizenship in both ancient Athens and modern America, Allen is the author of The World of Prometheus: The Politics of Punishing in Democratic Athens (2000), Talking to Strangers: Anxieties of Citizenship since Brown vs. the Board of Education (2004), Why Plato Wrote (2010), Our Declaration: A Reading of the Declaration of Independence in Defense of Equality (2014), Education and Equality (2016), and Cuz: The Life and Times of Michael A. (2017). She is the co-editor of the award-winning Education, Justice, and Democracy (2013, with Rob Reich) and From Voice to Influence: Understanding Citizenship in the Digital Age (2015, with Jennifer Light). She is a former Chair of the Mellon Foundation Board, past Chair of the Pulitzer Prize Board, and a member of the American Academy of Arts and Sciences and the American Philosophical Society.</p> <p>Allen is also the principal investigator for the Democratic Knowledge Project, a distributed research and action lab at Harvard University. The Democratic Knowledge Project seeks to identify, strengthen, and disseminate the bodies of knowledge, skills, and capacities that democratic citizens need in order to succeed at operating their democracy.</p>","subtitle":"A binary choice is often given in the conversations about the right pathway to defeat the coronavirus: we must prioritize lives over the economy or the economy over lives. Political theorist Dr. Danielle Allen joins Dan to describe a third pathway -...","imageURL":"https://ssl-static.libsyn.com/p/assets/9/a/c/a/9aca88284651e14c/htt3.jpg","pubDate":"2020-04-06T22:24:32.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/mobilize-and-transition-a-policy-to-defeat-covid-19-and-restore-america-with-dr-danielle-allen","enclosure":{"length":"46927115","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/36_Danielle_Allen.mp3?dest-id=1849868"},"duration":2902,"explicit":false},{"title":"Getting America Back to Business, with Mark Cuban","description":"<p>Dallas Mavericks owner and Shark Tank investor Mark Cuban joins Dan to give an inside look into what it takes to win on the long running reality show, shares his advice for entrepreneurs and small businesses trying to make it through the economic shutdown, and talks about how American manufacturing can stay competitive against countries like China and India in the coming decades.</p>","subtitle":"Dallas Mavericks owner and Shark Tank investor Mark Cuban joins Dan to give an inside look into what it takes to win on the long running reality show, shares his advice for entrepreneurs and small businesses trying to make it through the economic...","imageURL":"https://ssl-static.libsyn.com/p/assets/0/2/1/c/021c3eedaab957a4/htt3.jpg","pubDate":"2020-04-05T14:16:55.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/getting-america-back-to-business-with-mark-cuban","enclosure":{"length":"30343578","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/35_Mark_Cuban.mp3?dest-id=1849868"},"duration":1866,"explicit":false},{"title":"Here’s the Truth SPECIAL: The Hypocritical Attacks Against President Trump’s COVID-19 Response","description":"<p>Nancy Pelosi accused President Trump of “delay” and “denial” in the response to COVID-19. The political media was quick to repeat these talking points. But is that really the case? Were Democrats and the media sounding the alarm on coronavirus before the Trump Administration? Where did Democrats focus their attention as the White House ramped up their efforts to address coronavirus?</p> <p>I answer those questions with a detailed timeline of the Trump Administration’s response to this pandemic, and compare the president’s actions with the priorities of Speaker Pelosi over the last several weeks.</p>","subtitle":"Nancy Pelosi accused President Trump of “delay” and “denial” in the response to COVID-19. The political media was quick to repeat these talking points. But is that really the case? Were Democrats and the media sounding the alarm on coronavirus...","imageURL":"https://ssl-static.libsyn.com/p/assets/8/7/6/2/8762b10b22a5f583/htt3.jpg","pubDate":"2020-04-03T21:36:48.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/34-coronavirus-timeline","enclosure":{"length":"28401598","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/34_Coronavirus_Timeline.mp3?dest-id=1849868"},"duration":1744,"explicit":false},{"title":"How the Political Media Has Failed America, with David Harsanyi","description":"<p>Latest Gallup polling reveals that, among U.S. institutions and leaders, American media has the lowest approval rating in terms of its response to the coronavirus. Which aspects of the media's reporting on COVID-19 account for such unpopularity? How has the media's historical coverage of the Trump administration contributed to its current predicament? As we balance health and economic concerns amidst a pandemic, what kind of nuanced questions <em>should</em> the media be asking, but due to partisan \"gotcha\" games, are not? David Harsanyi shares his insight on these questions, as well as his take on the coronavirus relief package passed by Congress last week. </p> <p><strong>David Harsanyi</strong> is a senior writer for National Review and a former senior editor at The Federalist. Harsanyi is a nationally syndicated columnist and author of four books. His work has appeared in the Wall Street Journal, Washington Post, Weekly Standard, National Review, Reason, New York Post, and numerous other publications. David has appeared on Fox News, CNN, MSNBC, NPR, ABC World News Tonight, NBC Nightly News and dozens of radio talk shows across the country. </p>","subtitle":"Latest Gallup polling reveals that, among U.S. institutions and leaders, American media has the lowest approval rating in terms of its response to the coronavirus. Which aspects of the media's reporting on COVID-19 account for such...","imageURL":"https://ssl-static.libsyn.com/p/assets/4/1/a/5/41a5c3461ae7ec3b/htt3.jpg","pubDate":"2020-04-02T09:30:00.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/how-the-political-media-has-failed-america-with-david-harsanyi","enclosure":{"length":"72531324","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/33_David_Harsanyi.mp3?dest-id=1849868"},"duration":4503,"explicit":false},{"title":"Making China Pay - How to hold the Chinese Communist Party accountable for COVID-19, with Gordon Chang","description":"<p>With the revelation that China has suppressed and manipulated the data on COVID-19, how do we, or any nation, trust China under the Chinese Communist Party? And what are the reasons behind the World Health Organization and many American politicians and media outlets parroting the CCP’s propaganda about the virus? China expert Gordon Chang joins us to answer these questions and examine how China is exploiting the virus to its geopolitical advantage.</p> <p>Gordon Chang is a columnist, author, and lawyer who lived and worked in China and Hong Kong for almost two decades. His writing has appeared in The New York Times, The Wall Street Journal, and National Review and he is the author of The Coming Collapse of China. Find him on twitter at <span class= \"css-901oao css-16my406 r-1qd0xha r-ad9z0x r-bcqeeo r-qvutc0\">@GordonGChang.</span></p>","subtitle":"With the revelation that China has suppressed and manipulated the data on COVID-19, how do we, or any nation, trust China under the Chinese Communist Party? And what are the reasons behind the World Health Organization and many American politicians...","imageURL":"https://ssl-static.libsyn.com/p/assets/2/2/d/8/22d80e77ed9c6e5f/htt3.jpg","pubDate":"2020-04-01T01:20:57.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/making-china-pay-how-to-hold-the-chinese-communist-party-accountable-for-covid-19-with-gordon-chang","enclosure":{"length":"37389636","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/32_Gordon_Chang.mp3?dest-id=1849868"},"duration":2306,"explicit":false},{"title":"Corona Curveballs: Staying Houston Strong, with Astros pitcher Lance McCullers Jr","description":"<p>In this very special episode, Houston Astros pitcher Lance McCullers, Jr. joins Dan to talk about adapting to life in quarantine (hint: the training doesn’t stop, it just gets more creative). They dive into their workout routines, injury stories, and the right balance for celebrities and politics. Dan also shares further proof that he is in fact Wolverine.</p>","subtitle":"In this very special episode, Houston Astros pitcher Lance McCullers, Jr. joins Dan to talk about adapting to life in quarantine (hint: the training doesn’t stop, it just gets more creative). They dive into their workout routines, injury stories,...","imageURL":"https://ssl-static.libsyn.com/p/assets/6/9/4/6/694630005d381e98/htt3.jpg","pubDate":"2020-03-30T10:00:00.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/corona-curveballs-staying-houston-strong-with-astros-pitcher-lance-mccullers-jr","enclosure":{"length":"79937143","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/31_Lance_McCullers.mp3?dest-id=1849868"},"duration":4966,"explicit":false},{"title":"Our debt just got a whole lot bigger - solutions every young person should be fighting for, with Dr. Charles Blahous","description":"<p>Social Security is projected to be insolvent in 2035 - which means that millennials and gen z paying into the program today may never receive its benefits. Dr. Charles Blahous returns to the show to talk about how we got to this point, and a realistic plan to save the program for future generations.</p> <p>Dr. Charles Blahous is the J. Fish and Lillian F. Smith Chair and Senior Research Strategist at the Mercatus Center at George Mason University, where he specializes in domestic economic policy and retirement security, as well as federal fiscal policy, entitlements, and health care programs. Blahous is the author of Social Security: The Unfinished Work and Pension Wise: Confronting Employer Pension Underfunding and Sparing Taxpayers the Next Bailout, as well as the influential studies The Costs of a National Single-Payer Healthcare System and The Fiscal Consequences of the Affordable Care Act.</p>","subtitle":"Social Security is projected to be insolvent in 2035 - which means that millennials and gen z paying into the program today may never receive its benefits. Dr. Charles Blahous returns to the show to talk about how we got to this point, and a realistic...","imageURL":"https://ssl-static.libsyn.com/p/assets/5/1/d/0/51d0208c71a89ced/htt3.jpg","pubDate":"2020-03-29T16:14:53.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-problem-with-social-security-and-solutions-every-young-person-should-be-fighting-for-with-dr-charles-blahous","enclosure":{"length":"15369415","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/30_Charles_Blahous_on_Social_Security.mp3?dest-id=1849868"},"duration":930,"explicit":false},{"title":"The Consequences of Medicare-for-All and Single-Payer Health Care, with Chris Jacobs","description":"<p>Single-payer health care systems, such as Medicare-for-All, have long been pursued by far-left activists - but until recently remained on the fringes of the Democratic Party. Now it is front and center in the 2020 Democratic presidential primary and openly advocated for in mainstream media. What would really happen if we gave the federal government complete control of our health care system? Health care expert Chris Jacobs joins Dan to shed light on a policy that would have dramatic consequences for every American.</p> <p>Chris Jacobs, the Founder and CEO of Juniper Research Group, has spent more than 15 years studying health care on and off Capitol Hill. He has analyzed health policy and legislation for some of the leading lights of the conservative movement—including Jim DeMint, Bobby Jindal, Mike Pence, Pat Toomey, and Jeb Hensarling. He is the author of “The Case Against Single Payer - How ‘Medicare for All’ Will Wreck America’s Health Care System - And Its Economy”.</p>","subtitle":"Single-payer health care systems, such as Medicare-for-All, have long been pursued by far-left activists - but until recently remained on the fringes of the Democratic Party. Now it is front and center in the 2020 Democratic presidential primary and...","imageURL":"https://ssl-static.libsyn.com/p/assets/8/9/b/0/89b077dd5f67ff20/htt3.jpg","pubDate":"2020-03-28T20:35:43.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-consequences-of-medicare-for-all-and-single-payer-health-care-with-chris-jacobs","enclosure":{"length":"49206533","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/29_Chris_Jacobs_2.mp3?dest-id=1849868"},"duration":3045,"explicit":false},{"title":"What Happened This Week - Everything You Need to Know About the Stimulus Bill","description":"<p>This is a special episode of the podcast. No guests this time, just Dan here to give you a very detailed overview of the stimulus bill. Find out what’s in it, what’s not in it, and how the Democrats have been lying through their teeth constantly in a game of petty politics. There is a ton of detail in this episode, so to help you sort through it we’ve included a breakdown of topics:</p> <p>0:25 - Recap of what Democrats did this week to block passage of the stimulus bill.</p> <p>3:12 - Why Americans need an economic rescue package and how this is very different from the 2008 bailout.</p> <p>7:00 - What is really in the stimulus bill.</p> <p>11:00 - The truth about Democrats claims that by delaying the bill’s passage they got stricter controls on provision of credit to big business.</p> <p>16:45 - The long list of progressive items that had nothing to do with COVID-19 which the Democrats tried to add to the stimulus bill, like climate change studies and new emission standards for airlines.</p> <p>19:35 - On the bill that passed the Senate on Wednesday night (almost the same bill which could have been passed last weekend but for the Democrats delays).</p> <p>Details in the bill:</p> <p>24:53 - Individual tax rebates</p> <p>27:25 - Expansion of unemployment benefits</p> <p>30:37 - Small business loans</p> <p>32:40 - Housing support</p> <p>33:38 - Support for medical professionals on the front lines</p> <p>35:30 - Loans to distressed industries</p> <p>37:14 - Education and student loan relief</p> <p>Frequently asked questions about the bill:</p> <p>39:00 - Is there really $25 million allocated to give Congress a raise?</p> <p>39:38 - How does the bill help restaurants?</p> <p>40:00 - What does the bill do to support airline workers and keep the airline industry afloat?</p> <p>40:30 - What about the impact on non-profits like the YMCA?</p> <p>40:47 - Does the bill include funding for PPE, grant CMS authority to reduce unnecessary regulatory burdens, and increase tele-health?</p> <p>41:25 - Does the bill provide for student loan cancellation?</p> <p>42:13 - Does it provide relief for health clubs and studios?</p> <p>42:33 - What kind of stuff did Nancy Pelosi get into the bill that has nothing to do with COVID relief?</p> <p>43:22 - Is there a loophole for Planned Parenthood to get funding?</p> <p>43:37 - Will individuals who were injured and unable to work last year be eligible for stimulus?</p> <p>43:51 - Is there a way for an individual to prove that their finances are substantially less than in the previous tax year, so that they can be considered eligible for the stimulus?</p> <p>44:38 - Will this bill include Pelosi’s pork? Will there be consideration for the Green New Deal?</p> <p>45:08 - Why are we bailing out cruise ships that are registered in other countries so they can avoid paying taxes?</p> <p>45:34 - Are people that own their own businesses eligible for the crisis assistance?</p> <p>45:45 - How will the assistance be disbursed? Will it be automatically deposited or will they have to apply for it individually?</p> <p>45:59 - What about adults that don’t report anything to the IRS because their sole income comes from Social Security?</p> <p>46:08 - Concluding thoughts about the bill and the way forward from here.</p>","subtitle":"This is a special episode of the podcast. No guests this time, just Dan here to give you a very detailed overview of the stimulus bill. Find out what’s in it, what’s not in it, and how the Democrats have been lying through their teeth constantly...","imageURL":"https://ssl-static.libsyn.com/p/assets/6/f/d/c/6fdc6cd91c68ee81/htt3.jpg","pubDate":"2020-03-26T22:36:43.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/what-happened-this-week-everything-you-need-to-know-about-the-stimulus-bill","enclosure":{"length":"46788963","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/28_Dan_Update_on_the_Relief_Bill.mp3?dest-id=1849868"},"duration":2893,"explicit":false},{"title":"COVID-19, Outrage Culture, & the Future of Education - How one university is adapting in this tumultuous era, with Dr. Richard Ludwick","description":"<p>Dr. Richard Ludwick, President of the University of St. Thomas, joins Dan to talk about how his campus is adapting and responding to the threat of COVID-19, why skin in the game is so important for students choosing the major that will define their career, and how St. Thomas creates a culture of free and open dialogue among students in an era when identity politics and outrage culture are destroying many campuses.</p>","subtitle":"Dr. Richard Ludwick, President of the University of St. Thomas, joins Dan to talk about how his campus is adapting and responding to the threat of COVID-19, why skin in the game is so important for students choosing the major that will define their...","imageURL":"https://ssl-static.libsyn.com/p/assets/7/c/2/a/7c2acb78fb207ca0/htt3.jpg","pubDate":"2020-03-25T21:17:30.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/covid-19-outrage-culture-the-future-of-education-how-one-university-is-adapting-in-this-tumultuous-era-with-dr-richard-ludwick","enclosure":{"length":"45720850","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/27_Richard_Ludwick.mp3?dest-id=1849868"},"duration":2827,"explicit":false},{"title":"Democrats Are Holding Americans Hostage, with Joe Pags","description":"<p>Dan went on the Joe Pags Show to discuss one of the most cynical, disgusting, malevolent actions committed by Democrats in recent history: blocking the urgent relief needed for Americans out of work, businesses of all sizes, and our health care system. Call the office of every Democrat in Congress. Do not let them get away with this.</p> <p>Special thanks to Joe Pags for allowing us to re-broadcast his interview. Follow him on Twitter @JoeTalkShow.</p>","subtitle":"Dan went on the Joe Pags Show to discuss one of the most cynical, disgusting, malevolent actions committed by Democrats in recent history: blocking the urgent relief needed for Americans out of work, businesses of all sizes, and our health care...","imageURL":"https://ssl-static.libsyn.com/p/assets/9/a/4/6/9a46a286e159792f/htt3.jpg","pubDate":"2020-03-24T00:30:30.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/democrats-are-holding-americans-hostage-with-joe-pags","enclosure":{"length":"13540423","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/26_Joe_Pags.mp3?dest-id=1849868"},"duration":816,"explicit":false},{"title":"Saving the American Economy - Why Congress Needs to Pass a Stimulus Package Immediately, with Oren Cass","description":"<p>On Sunday night the Democrats torpedoed a bipartisan emergency bill that would have increased unemployment benefits, provided payroll and rent for small businesses, and financial assistance for millions of American households. Oren Cass joins us to discuss these and other stimulus measures which would bring desperately needed economic relief to Americans in the age of COVID-19. We also have a wide-ranging conversation about everything from the real cost of climate change to whether or not the gig economy is undermining American industries, and much more.</p> <p>Oren Cass is the executive director of American Compass, whose mission is to restore an economic orthodoxy that emphasizes the importance of family, community, and industry to the nation’s liberty and prosperity. From 2015 to 2019, Cass was a senior fellow at the Manhattan Institute, where his work on strengthening the labor market addressed issues ranging from the social safety net and environmental regulation to trade and immigration to education and organized labor. Cass regularly writes for publications including the New York Times, Wall Street Journal, National Affairs, and National Review, speaks at universities, and testifies before Congress. He is the author of The Once and Future Worker: A Vision for the Renewal of Work in America.</p>","subtitle":"On Sunday night the Democrats torpedoed a bipartisan emergency bill that would have increased unemployment benefits, provided payroll and rent for small businesses, and financial assistance for millions of American households. Oren Cass joins us to...","imageURL":"https://ssl-static.libsyn.com/p/assets/3/3/2/8/332872c22e6fbf64/htt3.jpg","pubDate":"2020-03-23T16:21:32.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/25-oren-cass","enclosure":{"length":"87597271","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/25_Oren_Cass.mp3?dest-id=1849868"},"duration":5444,"explicit":false},{"title":"The Psychology of a Pandemic, and How to be Anti-Fragile, with Dr. Jonathan Haidt","description":"<p>Best selling author Dr. Jonathan Haidt joins us to discuss the psychology of America’s reaction to the COVID-19 pandemic and how to build resilience and thrive in this volatile, uncertain world. Along the way we explore the rise of micro aggression and “safetyism” on campuses, the moral roots of conservatives and liberals, the increasingly toxic polarization on social media and college campuses, and the implications for our democracy.</p> <p>Dr. Haidt is a professor of social psychology at NYU-Stern and author of The Righteous Mind: Why Good People are Divided by Politics and Religion and co-author of The Coddling of the American Mind: How Good Intentions and Bad Ideas are Setting Up a Generation for Failure. He is also the co-founder of HeterodoxAcademy.org, a collaboration among nearly 2500 professors who are working to increase viewpoint diversity and freedom of inquiry in universities.</p>","subtitle":"Best selling author Dr. Jonathan Haidt joins us to discuss the psychology of America’s reaction to the COVID-19 pandemic and how to build resilience and thrive in this volatile, uncertain world. Along the way we explore the rise of micro aggression...","imageURL":"https://ssl-static.libsyn.com/p/assets/f/2/8/e/f28ecbd722a72ad1/htt3.jpg","pubDate":"2020-03-22T15:01:41.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-psychology-of-a-pandemic-and-how-to-be-anti-fragile-with-dr-jonathan-haidt","enclosure":{"length":"60538236","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/24_Jonathan_Haidt.mp3?dest-id=1849868"},"duration":3753,"explicit":false},{"title":"Could stem cells treat COVID-19? - The future of stem cell therapy, with Donna Chang","description":"<p>There are early indicators that the coronavirus harms a patient’s lungs, which is why older patients have trouble recovering from the virus – they don’t have the regenerative stem cells which develop naturally in our bodies as children. How does stem cell therapy help patients with coronavirus and other serious diseases and injuries? What are the challenges in getting this treatment to patients who need it? Stem cell innovator Donna Chang joins us to explain how stem cells work, their potential to change medicine forever, and the regulatory hurdles which researchers like her go through to bring this treatment to patients.</p> <p>Donna Chang is the Founder and CEO of Hope Biosciences, a biopharmaceutical company developing adult stem cell based therapeutics located in Sugar Land, Texas.</p>","subtitle":"There are early indicators that the coronavirus harms a patient’s lungs, which is why older patients have trouble recovering from the virus – they don’t have the regenerative stem cells which develop naturally in our bodies as children. How does...","imageURL":"https://ssl-static.libsyn.com/p/assets/5/6/8/f/568fc264a8637d43/htt3.jpg","pubDate":"2020-03-21T15:30:18.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/could-stem-cells-treat-covid-19-the-future-of-stem-cell-therapy-with-donna-chang","enclosure":{"length":"47233061","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/23_Donna_Chang.mp3?dest-id=1849868"},"duration":2921,"explicit":false},{"title":"China’s Propaganda Machine - How the communist party is changing the narrative on COVID-19 - with Michael Sobolik","description":"<p>The Communist Party of China’s initial failings in their reaction to the emergence of the new coronavirus greatly contributed to the global pandemic we are experiencing today. How are the party’s leaders spinning its response to the crisis to spread propaganda, claim a global leadership role, and shift blame to America? China expert Michael Sobolik returns to the podcast to give insight into how the Chinese government thinks and operates.</p> <p> </p> <p>Michael Sobolik is a Fellow in Indo-Pacific Studies at the American Foreign Policy Council and expert on China.</p>","subtitle":"The Communist Party of China’s initial failings in their reaction to the emergence of the new coronavirus greatly contributed to the global pandemic we are experiencing today. How are the party’s leaders spinning its response to the crisis to...","imageURL":"https://ssl-static.libsyn.com/p/assets/2/1/0/1/21017353511e5e6b/htt3.jpg","pubDate":"2020-03-21T03:02:21.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/chinas-propaganda-machine-how-the-communist-party-is-changing-the-narrative-on-covid-19-with-michael-sobolik","enclosure":{"length":"39519409","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/22_Michael_Sobolik.mp3?dest-id=1849868"},"duration":2439,"explicit":false},{"title":"The Economics of a Pandemic – What makes for good economic policy in the age of COVID-19? - with Dr. Ed Lazear","description":"<p>It has been exactly two months since the first case of coronavirus was detected in the United States. As the stock market continues to fall and businesses temporarily close, questions are mounting as to how to mitigate the economic impact of COVID-19. How is the current economic downturn different from the 2008 recession? What should be the overarching aim of our economic policy moving forward? How can Congress target the individuals and businesses that need assistance the most – both in the short-term and the long-term? Dr. Ed Lazear offers answers to these questions and more.</p> <p> </p> <p>Dr. Ed Lazear is Senior Fellow at the Hoover Institution and a Professor of Economics at Stanford University’s Graduate School of Business. He served as Chairman of the Council of Economic Advisors under President George W. Bush from 2006 to 2009. Dr. Lazear is a labor economist by trade and is the founder of the field of economics known as “personnel economics.” His extensive research, which has appeared in numerous economic journals, has focused primarily on employee incentive structures and productivity in firms. Dr. Lazear is the recipient of over two dozen awards and fellowships and is a frequent contributor to <em>Wall Street Journal</em>.</p>","subtitle":"It has been exactly two months since the first case of coronavirus was detected in the United States. As the stock market continues to fall and businesses temporarily close, questions are mounting as to how to mitigate the economic impact of COVID-19....","imageURL":"https://ssl-static.libsyn.com/p/assets/d/0/d/1/d0d139646104845e/htt3.jpg","pubDate":"2020-03-20T00:04:38.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-economics-of-a-pandemic-what-makes-for-good-economic-policy-in-the-age-of-covid-19-with-dr-ed-lazear","enclosure":{"length":"42756286","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/21_Ed_Lazear.mp3?dest-id=1849868"},"duration":2642,"explicit":false},{"title":"Why Is College So Expensive? Myths and Facts about Tuition, Student Loan Debt, and the New Alternatives - with Beth Akers","description":"<p>We dive into the depths of the student loan debate with higher education expert Beth Akers, co-author of Game of Loans: The Rhetoric and Reality of Student Debt. Progressive politicians have made student loan forgiveness one of their major talking points this election cycle, citing astronomical numbers on student debt. But who really owes that money? Do loan forgiveness programs already exist for people in the worst financial hardship? What alternative tuition financing models are emerging in the free market? Beth also shares invaluable advice for students applying to colleges.</p> <p>Beth Akers is a senior fellow at the Manhattan Institute, where her work focuses on labor economics and the economics of higher education. Previously, she was a fellow at the Brookings Institution and a staff economist with the Council of Economic Advisors under President George W. Bush. Her writing and research have been featured in, among others, The New York Times, USA Today, The Wall Street Journal, The Washington Post, Bloomberg, Quartz, Newsweek, and The Hill. She has appeared on CNBC, ABC News, Bloomberg TV, C-SPAN, among other TV and radio networks.</p>","subtitle":"We dive into the depths of the student loan debate with higher education expert Beth Akers, co-author of Game of Loans: The Rhetoric and Reality of Student Debt. Progressive politicians have made student loan forgiveness one of their major talking...","imageURL":"https://ssl-static.libsyn.com/p/assets/f/9/c/3/f9c3d4d5d8e8be5d/htt3.jpg","pubDate":"2020-03-12T16:11:26.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/why-is-college-so-expensive-myths-and-facts-about-tuition-student-loan-debt-and-the-new-alternatives-with-beth-akers","enclosure":{"length":"44950496","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/20_-_Beth_Akers.mp3?dest-id=1849868"},"duration":2779,"explicit":false},{"title":"The Truth About Gun Bans, Violent Crime, and Universal Background Checks. What Really Happens When Firearms are Banned, with Dr. John Lott","description":"<p>Dr. John Lott is an economist and a world-recognized expert on guns and crime. What happens in communities where guns are banned? Do universal background checks really accomplish what advocates say - or are there unintended consequences? How does gun ownership empower the weakest members of society? Dr. Lott has spent decades researching the statistics behind questions like these, and his answers may surprise you.</p> <p>Dr. Lott is Founder and President of the Crime Prevention Research Center. He has published over 100 articles in peer-reviewed academic journals and written nine books, including “More Guns, Less Crime,” “The Bias Against Guns,” and “Freedomnomics.”</p>","subtitle":"Dr. John Lott is an economist and a world-recognized expert on guns and crime. What happens in communities where guns are banned? Do universal background checks really accomplish what advocates say - or are there unintended consequences? How does gun...","imageURL":"https://ssl-static.libsyn.com/p/assets/d/d/2/d/dd2d9cab79840c9b/htt3.jpg","pubDate":"2020-03-05T15:09:05.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-truth-about-gun-bans-violent-crime-and-universal-background-checks-what-really-happens-when-firearms-are-banned-with-dr-john-lott","enclosure":{"length":"36668915","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/19_Dr_John_Lott.mp3?dest-id=1849868"},"duration":2261,"explicit":false},{"title":"What It's Like Being On a Committee with \"The Squad\" - with Rep. Patrick McHenry","description":"<p>Rep. Patrick McHenry is back to offer insight into the left’s approach to governance and the broader implications for everything from your 401k to the cost of housing in California vs Texas. What are their principles? What’s their end goal? McHenry is in a unique position to know, since he serves as ranking member on House Financial Services with Chairwoman Maxine Waters and three members of the ’Squad’ (Alexandria Ocasio-Cortez, Ayanna Pressley, and, Rashida Tlaib).</p>","subtitle":"Rep. Patrick McHenry is back to offer insight into the left’s approach to governance and the broader implications for everything from your 401k to the cost of housing in California vs Texas. What are their principles? What’s their end goal?...","imageURL":"https://ssl-static.libsyn.com/p/assets/d/a/5/e/da5ed06ca3e253a5/htt3.jpg","pubDate":"2020-03-01T19:04:05.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/what-its-like-being-on-a-committee-with-the-squad-with-rep-patrick-mchenry","enclosure":{"length":"27513206","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/18_Patrick_McHenry_2.mp3?dest-id=1849868"},"duration":1689,"explicit":false},{"title":"The New Energy Frontier, with Nigel Jenvey","description":"<p>What is carbon capture? Can we really use this technology to turn CO2 into a commodity? It might sound like science fiction, but it’s actually the New Energy Frontier in America.</p> <p>Nigel Jenvey is an industry leader and expert in Carbon Capture, Utilization and Storage (CCUS), having previously held roles such as the chair of the CO2 Capture Project, chair of the North American CCS Association, and program chair of the Society of Petroleum Engineers CCUS Technical Section. He leads the Carbon Management practice at Gaffney-Cline, a global oil and gas consultancy, helping clients understand the wide variety of options available that will ensure continued business success through the energy transition. He has over 23 years of global oil and gas industry experience in technology, exploration, development and production operations with major oil and gas operating companies.</p>","subtitle":"What is carbon capture? Can we really use this technology to turn CO2 into a commodity? It might sound like science fiction, but it’s actually the New Energy Frontier in America. Nigel Jenvey is an industry leader and expert in Carbon Capture,...","imageURL":"https://ssl-static.libsyn.com/p/assets/9/0/b/d/90bd0e3e492f94d1/htt3.jpg","pubDate":"2020-02-26T21:14:19.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-new-energy-frontier-with-nigel-jenvey","enclosure":{"length":"33931121","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/17_Nigel_Jenvey.mp3?dest-id=1849868"},"duration":2090,"explicit":false},{"title":"$23 T in Debt & Magic Monetary Theory, with Maya MacGuineas","description":"<p>Maya MacGuineas, head of the Committee for a Responsible Federal Budget, stopped by to help us pick apart Modern Monetary Theory, which is trendy again among certain members of Congress and presidential candidates. How are debts and deficits like termites in a basement? What are realistic paths toward a sustainable budget?</p> <p>Maya MacGuineas is the president of the bipartisan Committee for a Responsible Federal Budget. Her areas of expertise include budget, tax, and economic policy. As a leading budget expert for the past twenty years and a political independent, she has worked closely with members of both parties and serves as a trusted resource on Capitol Hill. MacGuineas testifies regularly before Congress and has published broadly, including regularly in The Washington Post, The Wall Street Journal, The New York Times, The Financial Times, The Atlantic, and numerous other outlets.</p>","subtitle":"Maya MacGuineas, head of the Committee for a Responsible Federal Budget, stopped by to help us pick apart Modern Monetary Theory, which is trendy again among certain members of Congress and presidential candidates. How are debts and deficits like...","imageURL":"https://ssl-static.libsyn.com/p/assets/0/a/e/0/0ae08b41a380a851/16_Maya_MacGuineas.jpg","pubDate":"2020-02-22T15:17:21.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/magic-monetary-theory-with-maya-macguineas","enclosure":{"length":"58727358","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/16_Maya_MacGuineas.mp3?dest-id=1849868"},"duration":3640,"explicit":false},{"title":"Inequality in America, What’s True and What Isn’t, with Ramesh Ponnuru","description":"<p><span style=\"font-weight: 400;\">The issue of inequality isn’t what many people think it is. Ramesh Ponnuru joins us to explain how to properly think about inequality and income mobility, and why tax increases and massive expansions of federal regulations do less to move people out of poverty and only increase wage stagnation, income immobility, the poverty rate, housing costs, student loan debt, and more. Ramesh and I discuss solutions that could actually benefit people who live in destitution, such as vocational training, occupational licensing reform, and the Earned Income Tax Credit.</span></p> <p><span style=\"font-weight: 400;\">Ramesh is a senior editor for National Review, a columnist for Bloomberg Opinion, a visiting fellow at the American Enterprise Institute, and a senior fellow at the National Review Institute. Follow him on Twitter at @rameshponnuru for more amazing facts and ideas.</span></p>","subtitle":"The issue of inequality isn’t what many people think it is. Ramesh Ponnuru joins us to explain how to properly think about inequality and income mobility, and why tax increases and massive expansions of federal regulations do less to move people out...","imageURL":"https://ssl-static.libsyn.com/p/assets/4/0/5/1/4051ee9f96f463c3/15_Ramesh_Ponnuru.jpg","pubDate":"2020-02-17T15:24:27.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/inequality-in-america-whats-true-and-what-isnt-with-ramesh-ponnuru","enclosure":{"length":"51592034","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/15_Ramesh_Ponnuru.mp3?dest-id=1849868"},"duration":3194,"explicit":false},{"title":"How Millennials Think, with Kristen Soltis Anderson","description":"<p>How have smart phones and social media shaped the political views of Millennials? What tricks do socialists like AOC and Bernie use to emotionally engage them into supporting programs like Medicare-for-All and the Green New Deal? Kristen Soltis Anderson joined me to delve into these topics and much more, including tips on how to bring young people into the conservative movement with honesty, not talking points.</p> <p> </p> <p>Kristen is a pollster, speaker, commentator, and author of The Selfie Vote: Where Millennials Are Leading America (And How Republicans Can Keep Up). She is co-founder of Echelon Insights, an opinion research and analytics firm that serves brands, trade associations, nonprofits, and political clients.</p>","subtitle":"How have smart phones and social media shaped the political views of Millennials? What tricks do socialists like AOC and Bernie use to emotionally engage them into supporting programs like Medicare-for-All and the Green New Deal? Kristen Soltis...","imageURL":"https://ssl-static.libsyn.com/p/assets/b/d/5/3/bd53cb61a02b6d87/14_Kristen_Solstis_Anderson.jpg","pubDate":"2020-02-15T20:42:24.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/how-millennials-think-with-kristen-soltis-anderson","enclosure":{"length":"89498907","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/14_Kristen_Solstis_Anderson.mp3?dest-id=1849868"},"duration":5563,"explicit":false},{"title":"Rafting Over Dams, with Jay Faison","description":"<p>Jay Faison is a philanthropist and entrepreneur who founded ClearPath in 2013 to develop and advance conservative policies that accelerate clean energy innovation.</p> <p>Jay joins Dan on the podcast to talk about the New Energy Frontier and to discuss why conservatives are (and have been) leading the way on clean energy and reducing emissions. They talk about American ingenuity and why the best way to tackle climate change is not through a carbon tax, but through the American innovation machine. There is also much discussion about \"Wet and Sandys\". Listen to find out more...</p>","subtitle":"Jay Faison is a philanthropist and entrepreneur who founded ClearPath in 2013 to develop and advance conservative policies that accelerate clean energy innovation. Jay joins Dan on the podcast to talk about the New Energy Frontier and to discuss why...","imageURL":"https://ssl-static.libsyn.com/p/assets/f/2/e/c/f2ecf3cfa20c213a/htt3.jpg","pubDate":"2020-02-13T21:12:31.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/rafting-over-dams-with-jay-faison","enclosure":{"length":"45554416","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/13_Jay_Faison.mp3?dest-id=1849868"},"duration":2729,"explicit":false},{"title":"How 5G Will Unleash Everything Awesome, with Ajit Pai","description":"<p><span style=\"font-weight: 400;\">Ajit Pai is Chairman of the Federal Communications Commission. We talk about the future of the internet, net neutrality, rural broadband, and, of course, our favorite memes.  We also hit on how government can get out of the way of innovation, allowing for more efficient transportation, telemedicine, and small business creation.</span></p>","subtitle":"Ajit Pai is Chairman of the Federal Communications Commission. We talk about the future of the internet, net neutrality, rural broadband, and, of course, our favorite memes.  We also hit on how government can get out of the way of innovation,...","imageURL":"https://ssl-static.libsyn.com/p/assets/d/6/4/c/d64c0b3c838217a6/01_Ajit_Pai.jpg","pubDate":"2020-02-09T22:44:16.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/how-5g-will-unleash-everything-awesome-with-ajit-pai-0","enclosure":{"length":"38645823","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/01_Ajit_Pai.mp3?dest-id=1849868"},"duration":2385,"explicit":false},{"title":"Pulling Back the Curtain On Iran, with Ray Takeyh","description":"<p><span style=\"font-weight: 400;\">Ray Takeyh is Hasib J. Sabbagh senior fellow for Middle East studies at the Council on Foreign Relations (CFR). His areas of specialization are Iran, political reform in the Middle East, and Islamist movements and parties. We examined the truth behind the November uprising, how the regime suppresses the will of the Iranian people, how the strike on Soleimani will help restore our deterrence posture and the numerous flaws with the JCPOA nuclear deal. </span></p>","subtitle":"Ray Takeyh is Hasib J. Sabbagh senior fellow for Middle East studies at the Council on Foreign Relations (CFR). His areas of specialization are Iran, political reform in the Middle East, and Islamist movements and parties. We examined the truth behind...","imageURL":"https://ssl-static.libsyn.com/p/assets/8/5/4/d/854df929ea53d0d3/02_Ray_Takeyh.jpg","pubDate":"2020-02-09T22:39:54.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/pulling-back-the-curtain-on-iran-with-ray-takeyh","enclosure":{"length":"46156249","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/02_Ray_Takeyh.mp3?dest-id=1849868"},"duration":2854,"explicit":false},{"title":"Do You Need 1000 Hours of Training to Dry Hair? Let’s Ask Shoshana Weissmann","description":"<p><span style=\"font-weight: 400;\">Shoshana Weissmann is a Senior Manager and Research Fellow at R Street Institute and the self-declared Senator of Twitter. She has helped elevate the national conversation on the weird world of occupational licensing and the needed reforms. We also discussed the best kind of sloths and the worst kind of sloths (hint: there are no bad sloths).</span></p>","subtitle":"Shoshana Weissmann is a Senior Manager and Research Fellow at R Street Institute and the self-declared Senator of Twitter. She has helped elevate the national conversation on the weird world of occupational licensing and the needed reforms. We also...","imageURL":"https://ssl-static.libsyn.com/p/assets/9/2/4/e/924e56d7877ea903/03_Shoshana_Weissmann.jpg","pubDate":"2020-02-09T22:36:04.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/do-you-need-1000-hours-of-training-to-dry-hair-lets-ask-shoshana-weissmann","enclosure":{"length":"52869565","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/03_Shoshana_Weissmann.mp3?dest-id=1849868"},"duration":3274,"explicit":false},{"title":"How Bitcoin Is Already Changing the World, with Rep. Patrick McHenry","description":"<p><span style=\"font-weight: 400;\">Patrick McHenry is the U.S. Representative for North Carolina’s 10th Congressional District and the Republican leader of the House Committee on Financial Services. We talked about how blockchain technology and bitcoin works, why it matters, and the future of currency.  This is the authoritative podcast if you want to grasp the intricacies of bitcoin and explain it to your friends. </span></p>","subtitle":"Patrick McHenry is the U.S. Representative for North Carolina’s 10th Congressional District and the Republican leader of the House Committee on Financial Services. We talked about how blockchain technology and bitcoin works, why it matters, and the...","imageURL":"https://ssl-static.libsyn.com/p/assets/6/9/7/7/69778bc5ccbcb9dc/04_Patrick_McHenry.jpg","pubDate":"2020-02-09T22:30:19.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/how-bitcoin-is-already-changing-the-world-with-rep-patrick-mchenry","enclosure":{"length":"24350708","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/04_Patrick_McHenry.mp3?dest-id=1849868"},"duration":1491,"explicit":false},{"title":"Coffee and Guns, with JT from Black Rifle Coffee","description":"<p><span style=\"font-weight: 400;\">Jarred “Landing” Taylor is an Air Force veteran and the President of Article 15 Clothing, the Marketing Director of Leadslingers Spirits, and works in business development for Black Rifle Coffee Company. We had a wide ranging conversation about everything from the latest frontiers in space exploration to the challenges facing soldiers coming home from combat.</span></p>","subtitle":"Jarred “Landing” Taylor is an Air Force veteran and the President of Article 15 Clothing, the Marketing Director of Leadslingers Spirits, and works in business development for Black Rifle Coffee Company. We had a wide ranging conversation about...","imageURL":"https://ssl-static.libsyn.com/p/assets/f/1/6/9/f169d8f5ec55cd84/05_Jarred_Taylor.jpg","pubDate":"2020-02-09T22:26:29.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/coffee-and-guns-with-jt-from-black-rifle-coffee","enclosure":{"length":"75053610","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/05_Jarred_Taylor.mp3?dest-id=1849868"},"duration":4660,"explicit":false},{"title":"Everything You Need to Know About China, with Michael Sobolik","description":"<p><span style=\"font-weight: 400;\">Michael Sobolik is a Fellow in Indo-Pacific Studies at the American Foreign Policy Council. There is no doubt that China is our number one geoeconomic competitor, and what happens next in the U.S-China relationship may very well transform your life and how you see the world. We discussed China’s strategic goals and how America can retain its leadership of the global order.  We delved into China’s threatening behavior in the South China Sea, their abusive trade practices, and China’s harsh repression of millions of their own citizens.</span></p>","subtitle":"Michael Sobolik is a Fellow in Indo-Pacific Studies at the American Foreign Policy Council. There is no doubt that China is our number one geoeconomic competitor, and what happens next in the U.S-China relationship may very well transform your life...","imageURL":"https://ssl-static.libsyn.com/p/assets/9/4/0/8/94085e60d04cf858/06_Michael_Sobolik.jpg","pubDate":"2020-02-09T22:15:08.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/everything-you-need-to-know-about-china-with-michael-sobolik","enclosure":{"length":"38473470","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/06_Michael_Sobolik.mp3?dest-id=1849868"},"duration":2374,"explicit":false},{"title":"Free Speech is Under Attack, with Former President of the ACLU, Nadine Strossen","description":"<p><span style=\"font-weight: 400;\">Nadine Strossen is the John Marshall Harlan II Professor of Law, Emerita at New York Law School. From 1991 through 2008, she served as President of the American Civil Liberties Union, the first woman to head the nation’s largest and oldest civil liberties organization. Topics include the future of free speech and the role of social media companies in censorship. Nadine discussed why censorship so frequently fails and how limits on free speech were used to suppress the civil rights movement. We also debate abortion as it pertains to civil liberties. </span></p>","subtitle":"Nadine Strossen is the John Marshall Harlan II Professor of Law, Emerita at New York Law School. From 1991 through 2008, she served as President of the American Civil Liberties Union, the first woman to head the nation’s largest and oldest civil...","imageURL":"https://ssl-static.libsyn.com/p/assets/0/1/9/b/019b96c7d2018d12/07_Nadine_Strossen.jpg","pubDate":"2020-02-09T22:10:46.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/free-speech-is-under-attack-with-former-president-of-the-aclu-nadine-strossen","enclosure":{"length":"65354958","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/07_Nadine_Strossen.mp3?dest-id=1849868"},"duration":4054,"explicit":false},{"title":"Saving the Environment with Clean, Cheap, and Exportable Energy, with Neil Chatterjee","description":"<p><span style=\"font-weight: 400;\">Neil Chatterjee is the Chairman of the Federal Energy Regulatory Commission. Texas has an abundance of clean, cheap, exportable energy and no one knows that better than Chairman Chatterjee. We discussed Texas’s unique situation with competitive retail markets and the impact of American energy in decreasing global emissions and increasing global standards of living.</span></p>","subtitle":"Neil Chatterjee is the Chairman of the Federal Energy Regulatory Commission. Texas has an abundance of clean, cheap, exportable energy and no one knows that better than Chairman Chatterjee. We discussed Texas’s unique situation with competitive...","imageURL":"https://ssl-static.libsyn.com/p/assets/f/8/0/d/f80d41a2854fd976/htt3.jpg","pubDate":"2020-02-09T21:59:58.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/saving-the-environment-with-clean-cheap-and-exportable-energy-with-neil-chatterjee","enclosure":{"length":"28412347","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/08_Neil_Chatterjee.mp3?dest-id=1849868"},"duration":1658,"explicit":false},{"title":"Why Embracing Capitalism Leads to a Better World for Everybody, with Marian Tupy of HumanProgress.org","description":"<p><span style=\"font-weight: 400;\">Marian L. Tupy is the editor of Human​Progress​.org and a senior policy analyst at the Center for Global Liberty and Prosperity. He specializes in globalization and global well‐​being, and the political economy of Europe and sub‐​Saharan Africa. </span></p> <p><span style=\"font-weight: 400;\">Poverty, human rights, education, life expectancy, and virtually every other aspect of our lives has improved dramatically over the last 100 years. We talked about why capitalism made this possible, and the disturbing rise in the popularity of socialism in today’s free societies.</span></p>","subtitle":"Marian L. Tupy is the editor of Human​Progress​.org and a senior policy analyst at the Center for Global Liberty and Prosperity. He specializes in globalization and global well‐​being, and the political economy of Europe and sub‐​Saharan...","imageURL":"https://ssl-static.libsyn.com/p/assets/f/1/7/e/f17ec8b09d84a27e/htt3.jpg","pubDate":"2020-02-09T21:55:01.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/why-embracing-capitalism-leads-to-a-better-world-for-everybody-with-marian-tupy-of-humanprogressorg","enclosure":{"length":"54086426","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/09_Marian_Tupy.mp3?dest-id=1849868"},"duration":3262,"explicit":false},{"title":"Nuclear Energy, Chernobyl, and the Simpsons, with Maria Korsnick","description":"<p><span style=\"font-weight: 400;\">Maria Korsnick is the President and CEO of the Nuclear Energy Institute. Clean energy is currently one of our most important conversations on Capitol Hill. Maria joined me to debunk some of the myths about nuclear energy, that there really is *no* green slime in nuclear plants, and why nuclear needs to be a critical piece of our clean energy plans.</span></p>","subtitle":"Maria Korsnick is the President and CEO of the Nuclear Energy Institute. Clean energy is currently one of our most important conversations on Capitol Hill. Maria joined me to debunk some of the myths about nuclear energy, that there really is *no*...","imageURL":"https://ssl-static.libsyn.com/p/assets/c/2/c/c/c2cc1452ce808230/htt3.jpg","pubDate":"2020-02-09T21:47:58.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/nuclear-energy-chernobyl-and-the-simpsons-with-maria-korsnick","enclosure":{"length":"39885334","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/11_Maria_Korsnick.mp3?dest-id=1849868"},"duration":2375,"explicit":false},{"title":"The Medicare for All Fraud, with Charles Blahous","description":"<p><span style=\"font-weight: 400;\">Charles Blahous is the J. Fish and Lillian F. Smith Chair and Senior Research Strategist at the Mercatus Center at George Mason University, where he specializes in domestic economic policy and retirement security, as well as federal fiscal policy, entitlements, and health care programs. Blahous is the author of the influential studies</span> <em><span style=\"font-weight: 400;\">The Costs of a National Single-Payer Healthcare System</span></em> <span style= \"font-weight: 400;\">and</span> <em><span style= \"font-weight: 400;\">The Fiscal Consequences of the Affordable Care Act.</span></em></p> <p><span style=\"font-weight: 400;\">Medicare for All is expensive -- and Dr. Blahous tells us exactly *how* expensive this single-payer system would be. This would impact not just the very top of the 1%, but your everyday middle class family.</span></p>","subtitle":"Charles Blahous is the J. Fish and Lillian F. Smith Chair and Senior Research Strategist at the Mercatus Center at George Mason University, where he specializes in domestic economic policy and retirement security, as well as federal fiscal policy,...","imageURL":"https://ssl-static.libsyn.com/p/assets/7/2/f/7/72f7bb42fc06666d/htt3.jpg","pubDate":"2020-02-09T21:47:34.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/the-medicare-for-all-fraud-with-charles-blahous","enclosure":{"length":"40715259","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/10_Charles_Blahous.mp3?dest-id=1849868"},"duration":2426,"explicit":false},{"title":"Cheaper, Better, Prescription Drugs, with Former FDA Commissioner Scott Gottlieb","description":"<p><span style=\"font-weight: 400;\">Dr. Scott Gottlieb is the former commissioner of the Food and Drug Administration and resident fellow at the American Enterprise Institute, where he continues his work on improving public health through entrepreneurship and medical innovation and on expanding regulatory approaches to maintain patient and physician autonomy. </span></p> <p><span style=\"font-weight: 400;\">We talked about regulatory approaches to making prescription drugs more affordable. Learn why price controls, like those which would be implemented in the Democrats’ drug pricing bill HR3, have terrible consequences for the development and innovation of prescription drugs.</span></p>","subtitle":"Dr. Scott Gottlieb is the former commissioner of the Food and Drug Administration and resident fellow at the American Enterprise Institute, where he continues his work on improving public health through entrepreneurship and medical innovation and on...","imageURL":"https://ssl-static.libsyn.com/p/assets/3/8/5/5/3855d56b0df03de6/htt3.jpg","pubDate":"2020-02-09T21:47:11.000Z","link":"https://holdthesetruthswithdancrenshaw.libsyn.com/cheaper-better-prescription-drugs-with-former-fda-commissioner-scott-gottlieb","enclosure":{"length":"51962272","type":"audio/mpeg","url":"https://traffic.libsyn.com/secure/holdthesetruthswithdancrenshaw/12_Scott_Gottlieb.mp3?dest-id=1849868"},"duration":3127,"explicit":false}]}