{"meta":{"title":"Republicans Defeating Trump","description":"American politics is in crisis. Together, the founders of The Lincoln Project have spent over 200 years electing Republicans. But now, they’ve sparked a nationwide movement with a singular mission: To defeat Donald Trump and Trumpism. Join political experts Ron Steslow, Jennifer Horn, Reed Galen, George Conway, Steve Schmidt, Mike Madrid, Rick Wilson, and John Weaver as they defy their party and reveal how Trump will be defeated, discuss what’s at stake in the 2020 election, and share the stories of voters all across America who are putting country over party.","imageURL":"https://storage.buzzsprout.com/variants/c5sz6askf5itvdr36phs8mkx6056/8d66eb17bb7d02ca4856ab443a78f2148cafbb129f58a3c81282007c6fe24ff2.jpg","author":"The Lincoln Project","categories":["News","Politics"]},"episodes":[{"title":"Trump vs George Conway","description":"<p>Ron Steslow sits down with conservative attorney and Lincoln Project co-founder George Conway for a deeper discussion about his involvement with, and change of heart toward, Donald Trump. Ron and George also discuss how the President’s psychological state is affecting the country, and the two looming Supreme Court cases dealing with Trump’s tax returns that are due to set an important legal precedent around presidential power.</p>","pubDate":"2020-06-10T19:00:00.000Z","enclosure":{"length":"44554614","type":"audio/mpeg","url":"https://www.buzzsprout.com/1112924/4121153-trump-vs-george-conway.mp3?blob_id=15872063"}},{"title":"Meet The Founders Of The Lincoln Project","description":"<p>Lifelong Republicans have broken ranks with their party to defeat Donald Trump. Ron Steslow sits down with his fellow founders at The Lincoln Project to share with listeners who they are, what The Lincoln Project means to them, and why this movement is resonating with so many people.&nbsp;</p>","pubDate":"2020-06-08T10:00:00.000Z","enclosure":{"length":"40544179","type":"audio/mpeg","url":"https://www.buzzsprout.com/1112924/4080083-meet-the-founders-of-the-lincoln-project.mp3?blob_id=15711488"}},{"title":"Republicans Defeating Trump Podcast Trailer","description":"<p>American politics is in crisis. Together, the founders of The Lincoln Project have spent over 200 years electing Republicans. But now, they’ve sparked a nationwide movement with a singular mission: To defeat Donald Trump and Trumpism. Make sure to subscribe for updates! The Lincoln Project's new podcast is launching June 8th.&nbsp;</p>","pubDate":"2020-05-23T20:00:00.000Z","enclosure":{"length":"1052372","type":"audio/mpeg","url":"https://www.buzzsprout.com/1112924/3887594-republicans-defeating-trump-podcast-trailer.mp3?blob_id=14736254"}}]}