{"meta":{"title":"Wiser Than Yesterday","description":"In-depth breakdowns of some of the worlds most thought-provoking and inspiring books.\nOur hosts, Nicolas Vereecke and Sam Harris digest non-fiction books from all centuries and genres.\nThis podcast is here to help listeners become smarter. To learn about ideas they haven't heard of or to gain more perspectives on the books and ideas they are familiar with.\nWe dive into topics such as philosophy, business, feminism, psychology, politics, economics and who knows what else. Our goal is to simply explore the best ideas and learn new things. You're most welcome to join us for the ride.\n<a href=\"https://imgur.com/G7uaLqF\"><img src=\"https://i.imgur.com/G7uaLqF.png\" title=\"source: imgur.com\" /></a>\n","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/cover.jpg?v=1","author":"Sam Harris & Nicolas Vereecke","categories":["Arts","Books"]},"episodes":[{"title":"12. Nassim Nicholas Taleb - Skin in the game","description":"Skin in the Game: Hidden Asymmetries in Daily Life, is a 2018 nonfiction book by Nassim Nicholas Taleb, a former options trader with a background in the mathematics of probability and statistics.\nTaleb's thesis is that skin in the game -- i.e., having a measurable risk when taking a major decision -- is necessary for fairness, commercial efficiency, and risk management, as well as being necessary to understand the world. The book is the last part of Taleb's multi-volume philosophical essay on uncertainty, titled the Incerto.\nSummary\nAnother classic book from Taleb. He makes a sound argument for alignment of inscentives and why many problems in the world come from people not having skin in the game.\nKey Idea\nIf an actor pockets some rewards from a policy they enact or support without accepting any of the risks, economists consider it to be a problem of \"missing incentives\". In contrast, to Taleb, the problem is more fundamentally one of asymmetry: one actor gets the rewards, the other is stuck with the risks.[1]\nTaleb argues that \"For social justice, focus on symmetry and risk sharing. You cannot make profits and transfer the risks to others, as bankers and large corporations do... Forcing skin in the game corrects this asymmetry better than thousands of laws and regulations.\"\nThe centrality of negative incentives\nActors - per Taleb - must bear a cost when they fail the public. A fund manager that gets a percentage on wins, but no penalty for losing is incentivized to gamble with his clients funds. Bearing no downside for one's actions means that one has no \"Skin In The Game\", which is the source of many evils.\nAn evolutionary process is an additional argument for SITG. Those who err and have SITG will not survive, hence evolutionary processes will eliminate (physically or figuratively by going bankrupt etc) those tending to do stupid things. Without SITG, this process cannot work.\nExamples\nRobert Rubin, a highly-paid director and senior advisor at Citigroup, paid no financial penalty when Citigroup had to be rescued by U.S. taxpayers due to overreach. Taleb calls this sort of a trade, with upside gain but no or limited downside risk, a \"Bob Rubin trade.\"\nIntellectual Yet Idiot\nIntellectual Yet Idiot (IYI) is a term coined by Nassim Nicholas Taleb in his essay by the same name that refers to the semi-intelligent well-pedigreed \"who are telling us 1) what to do, 2) what to eat, 3) how to speak, 4) how to think… and 5) who to vote for\".\nThey represent a very small minority of people but have an overwhelming impact on the vast majority because they affect government policy. IYI are often policy makers, academics, journalists, and media pundits.\nSome favourite quotes\nThe knowledge we get by tinkering, via trial and error, experience, and the workings of time, in other words, contact with the earth, is vastly superior to that obtained through reasoning, something self-serving institutions have been very busy hiding from us.\nBureaucracy is a construction by which a person is conveniently separated from the consequences of his or her actions.\nAvoid taking advice from someone who gives advice for a living, unless there is a penalty for their advice.\nSeeing the psychologist Steven Pinker making pronouncements about things intellectual has a similar effect to encountering a drive-in Burger King while hiking in the middle of a national park.\nEvidence of submission is displayed by the employee’s going through years depriving himself of his personal freedom for nine hours every day, his ritualistic and punctual arrival at an office, his denying himself his own schedule, and his not having beaten up anyone on the way back home after a bad day. He is an obedient, housebroken dog.\nWhat we saw worldwide from 2014 to 2018, from India to the U.K. to the U.S., was a rebellion against the inner circle of no-skin-in-the-game policymaking “clerks” and journalists-insiders, that class of paternalistic semi-intellectual experts with some Ivy League, Oxford-Cambridge or similar label-driven education who are telling the rest of us 1) what to do, 2) what to eat, 3) how to speak, 4) how to think, and… 5) whom to vote for.\nPeople who are bred, selected, and compensated to find complicated solutions do not have an incentive to implement simplified ones.\nIf your private life conflicts with your intellectual opinion, it cancels your intellectual ideas, not your private life.\nSurvival comes first, truth, understanding, and science later. \n","subtitle":"Hidden Asymmetries in Daily Life. Having a measurable risk when taking a major decision -- is necessary for fairness, commercial efficiency, and risk management, as well as being necessary to understand the world.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/5/542e8b37-7fa9-477e-adba-28791909b4ed/cover.jpg?v=1","pubDate":"2020-06-07T06:00:00.000Z","enclosure":{"length":"26047053","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/542e8b37-7fa9-477e-adba-28791909b4ed.mp3"}},{"title":"11. Nassim Nicholas Taleb - Antifragile","description":"Nassim Nicholas Taleb present a blueprint of how to live in a 'Black Swan' world.\nHe begins the book:\n\"Some things benefit from shocks; they thrive and grow when exposed to volatility, randomness, disorder, and stressors and love adventure, risk, and uncertainty. Yet, in spite of the ubiquity of the phenomenon, there is no word for the exact opposite of fragile. Let us call it antifragile. Antifragility is beyond resilience or robustness. The resilient resists shocks and stays the same; the antifragile gets better\"\nHe spends the rest of the book explaining how to become antifragile. It is a great resource for anyone wanting to have greater control on a random world and to grow stronger as things go wrong.\nSyncify\nThe social audio app - Listen to podcasts and books together with friends.\nCombat isolation and loneliness\nLearn more by sharing ideas\nSign up at SyncifyApp.com \n","subtitle":"Things that Gain from Disorder.\r\n\r\nWe discuss the concepts of things that thrive and grow when exposed to volatility.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/0/01c012f8-ea16-4f35-94ec-7887a33d84ac/cover.jpg?v=1","pubDate":"2020-05-20T06:00:00.000Z","enclosure":{"length":"57022895","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/01c012f8-ea16-4f35-94ec-7887a33d84ac.mp3"}},{"title":"10. Nassim Nicholas Taleb - The bed of Procrustes","description":"Nassim Nicholas Taleb wrote some of his favourite maxims and ways to think in life into a book.\nThis is a great hand book for nuggets of wisdom to ponder upon. Thus ponder we do on some of our favourites.\nSome examples include\n* What fools call “wasting time” is most often the best investment.\n* A man without a heroic bent starts dying at the age of thirty.\n* The difference between slaves in Roman and Ottoman days and today’s employees is that slaves did not need to flatter their boss.\n* You are rich if and only if money you refuse tastes better than money you accept.\n* Modernity: we created youth without heroism, age without wisdom, and life without grandeur.\n* You can tell how uninteresting a person is by asking him whom he finds interesting.\n* Procrastination is the soul rebelling against entrapment.\n* Preoccupation with efficacy is the main obstacle to a poetic, elegant, robust and heroic life.\n* Those who do not think that employment is systemic slavery are either blind or employed.\n* They are born, put in a box; they go home to live in a box; they study by ticking boxes; they go to what is called “work” in a box, where they sit in their cubicle box; they drive to the grocery store in a box to buy food in a box; they talk about thinking “outside the box”; and when they die they are put in a box.\n* A good maxim allows you to have the last word without even starting a conversation. \n","subtitle":"Philosophical and Practical Aphorisms","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/4/474b5de5-c520-4c4e-9a72-341da612da7d/cover.jpg?v=1","pubDate":"2020-05-14T06:00:00.000Z","enclosure":{"length":"26307693","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/474b5de5-c520-4c4e-9a72-341da612da7d.mp3"}},{"title":"9.  Nassim Nicholas Taleb - The Black Swan","description":"The Black Swan focuses on the extreme impact of rare and unpredictable outlier events — and the human tendency to find simplistic explanations for these events, retrospectively.\nIt was published in 2007, by author and former options trader Nassim Nicholas Taleb. \nCoronavirus and Pandemics\nThis book is extremely poigniant for understanding the Coronavirus pandemic and it's effects. In the book he explains why we would be caught unawares by such an event and why we should build robust systems for events like this. During the discussion on the show we talk through a lot of the ideas he explains in relations to how it can help with the current situation and building robust systems for future events that we can not predict.\nIdea\nA central idea in Taleb's book is not to attempt to predict Black Swan events, but to build robustness to negative events and an ability to exploit positive events. Taleb contends that banks and trading firms are vulnerable to hazardous Black Swan events and are exposed to losses beyond those predicted by their defective financial models.\nThe book asserts that a \"Black Swan\" event depends on the observer: for example, what may be a Black Swan surprise for a turkey is not a Black Swan surprise for its butcher. Hence the objective should be to \"avoid being the turkey\", by identifying areas of vulnerability in order to \"turn the Black Swans white\".\nAbout\nTaleb has referred to the book as an essay or a narrative with one single idea: \"our blindness with respect to randomness, particularly large deviations.\" The book moves from literary subjects in the beginning to scientific and mathematical subjects in the later portions. Part One and the beginning of Part Two delve into psychology. Taleb addresses science and business in the latter half of Part Two and Part Three. Part Four contains advice on how to approach the world in the face of uncertainty and still enjoy life.\nThe book has been described by The Sunday Times as one of the twelve most influential books since World War II. As of 2019, it has been cited approximately 10,000 times, 9,000 of which are for the English-language edition (we can expect a lot more after the Coronavirus event). The book spent 36 weeks on the New York Times Bestseller list;17 as hardcover and 19 weeks as paperback. It was published in 32 languages. \n","subtitle":"The book focuses on the extreme impact of rare and unpredictable outlier events — and the human tendency to find simplistic explanations for these events, retrospectively.\r\nIt was published in 2007, by author and former options trader Nassim Nicholas Taleb. ","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/7/7c262740-e637-4be4-af22-f411a20e46b6/cover.jpg?v=2","pubDate":"2020-05-07T08:00:00.000Z","enclosure":{"length":"77534187","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/7c262740-e637-4be4-af22-f411a20e46b6.mp3"}},{"title":"8. Nassim Nicholas Taleb - Fooled By Randomness","description":"Fooled by Randomness: The Hidden Role of Chance in Life and in the Markets is a book that deals with the fallibility of human knowledge.\nNassim Nicholas Taleb explains how we delude ourselves into thinking untrue things due to our love of finding a story or reason when none exists.\nIn the episode, we explore the many examples of human behaviour failing us and the isights we can learn form this book. We discuss how the relates to trading and the economy and the wider aspects of being a more logical human. \n","subtitle":"Fooled by Randomness: The Hidden Role of Chance in Life and in the Markets is a book that deals with the fallibility of human knowledge.\r\n\r\nNassim Nicholas Taleb explains how we delude ourselves into thinking untrue things due to our love of finding a story or reason when none exists.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/3/3f00e799-d11b-4540-bfbd-5338dbf55baa/cover.jpg?v=1","pubDate":"2020-05-03T06:00:00.000Z","enclosure":{"length":"24068224","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/3f00e799-d11b-4540-bfbd-5338dbf55baa.mp3"}},{"title":"7. David Nihil - Do You Talk Funny?: 7 Comedy Habits to Become a Better (and Funnier) Public Speaker","description":"Public speaking can be terrifying. For David Nihill, the idea of standing in front of an audience was scarier than cliff jumping into a thorny pit of spiders and mothers-in-law. Without a parachute or advanced weaponry. \nThis book is a part story and part manual. It follows David's story to become an engaging public speaker and the lessons he learnt along the way. It shows how anyone can become funny and breaks down the steps to get there.\nIt is a highly motivating book for someone who is nervous of approaching the world of public speaking, business presentations and things like a Ted speech. David goes into the science of what makes a great speech and how to reflect and add moments that capture your audiences imagination and increase your confidence.\nThe idea of doing stand up comedy seems like a distant and scary dream to 99% of humans. This book makes it seem quite possible and we expain the lessons learnt and how to approach becoming a funnie speaker. \n","subtitle":"This book shows how the key principles of stand-up comedy can be applied to your speaking engagements and presentations to make you funnier, more interesting, and better looking. (Or at least two of the three.)","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/7/766babc9-427c-455d-9d73-f8e2082f505f/cover.jpg?v=1","pubDate":"2020-04-28T07:00:00.000Z","enclosure":{"length":"54723440","type":"audio/mp3","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/766babc9-427c-455d-9d73-f8e2082f505f.mp3"}},{"title":"6. James P. Carse - Finite and Infinite Games: A Vision of Life as Play and Possibility","description":"This book is challenging. Some people hate. Many people love it.\nIt has been described as, \"Disturbingly good\" for it's ability to shake the concepts of what you think about your approaches to life. It is regarded as a book you need to read, re-read and then read again.\nWe blindly dive into it and attempt to distill it's wisdom for listeners in a usable manner, whilst not making too big a fools of ourselves.\nAbout\nJames P. Carse is a philosopher and author. He published this book in 1986 and it has never lost relevance.\n\" There are at least two kinds of games. One could be called finite; the other infinite. A finite game is played for the purpose of winning, an infinite game for the purpose of continuing the play.\"\nA simple concept with oodles of insights that go deeper and deeper. Question everything you think you know and dive into a redefinition of how you approach everything. Some nice quotes to get you started:\n“A finite game is played for the purpose of winning, an infinite game for the purpose of continuing the play.”\n“There is no finite game unless the players freely choose to play it. No one can play who is forced to play.”\n“Rules are not valid because the Senate passed them, or because heroes once played by them, or because God pronounced them through Moses or Muhammad.”\n“There are no rules that require us to obey rules. If there were, there would have to be a rule for those rules, and so on.”\n“It may appear that the prizes for winning are indispensable, that without them life is meaningless, perhaps even impossible.”\n“While no one is forced to remain a lawyer or a rodeo performer or a kundalini yogi after being selected for these roles, each role is nonetheless surrounded both by ruled restraints and expectations on the part of others….\"\n\"We cannot do whatever we please and remain lawyers or yogis— and yet we could not be either unless we pleased.”\n“The constant attentiveness of finite players to the progress of the competition can lead them to believe that every move they make they must make.” \n","subtitle":"There are at least two kinds of games. One could be called finite; the other infinite. A finite game is played for the purpose of winning, an infinite game for the purpose of continuing the play.\r\nA simple concept with oodles of insights that go deeper and deeper. Question everything you think you know and dive into a redefinition of how you approach everything.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/7/71004c39-066a-460d-a8f4-7478f1125c2b/cover.jpg?v=1","pubDate":"2020-04-21T07:30:00.000Z","enclosure":{"length":"56807384","type":"audio/mp3","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/71004c39-066a-460d-a8f4-7478f1125c2b.mp3"}},{"title":"5. Caroline Criado Perez - Invisible Women: Exposing Data Bias in a World Designed for Men","description":"This book exposes the gender bias that is in the world around us and affects our daily lives. A brilliant look at the data that shows the facts we need to acknowledge and overcome.\nCaroline presents a very thourough study into the way the world has been built and how it has been unfair on women. This is a revealing book which was a brilliant read for anyone. As two white guys we really had a lot to learn and enjoyed discussing this book and what we can do to improve things.\nAbout the Author\nCaroline Criado Perez is a writer, broadcaster and award-winning feminist campaigner. Her most notable campaigns have included co-founding The Womens Room, getting a woman on Bank of England banknotes, forcing Twitter to revise its procedures for dealing with abuse and successfully campaigning for a statue of suffragist Millicent Fawcett to be erected in Parliament Square. She was the 2013 recipient of the Liberty Human Rights Campaigner of the Year Award, and was awarded an OBE in the Queen s Birthday Honours 2015.\nAwards\nInvisible Women has won the FT & McKinsey Business Book of the Year Award, the Books Are My Bag Readers Choice Award and the Royal Society Science Book Prize. She lives in London. \n","subtitle":"The gender bias that is in the world around us and affects our daily lives. A brilliant look at the data that shows the facts we need to acknowledge and overcome.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/a/a0744efc-959f-44f5-a176-25957a3bb68b/cover.jpg?v=1","pubDate":"2020-04-16T08:00:00.000Z","enclosure":{"length":"59189751","type":"audio/mp3","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/a0744efc-959f-44f5-a176-25957a3bb68b.mp3"}},{"title":"4. Niel Strauss - The Game: Penetrating the Secret Society of Pickup Artists","description":"The Game: Penetrating the Secret Society of Pickup Artists (also known as The Game: Undercover in the Secret Society of Pickup Artists) is a non-fiction book written by investigative reporter Neil Strauss as a chronicle of his journey and encounters in the seduction community.\nThe book was featured on The New York Times Bestseller List for two months after its release in September 2005, reaching prominence again in 2007 during the broadcast of the VH1 television series The Pickup Artist, which was hosted by Mystery, Strauss's mentor in the book. In its original published hardcover format, the book was covered in black leather and bookmarked with red satin, similar to some printings of the Bible. Despite the reputation that The Game has gained as an exposé on the seduction community, it was primarily written as an autobiographical work. The follow-up book, Rules of the Game, relies more on the how-to side.\nAn interesting book to discuss that polarises a lot of people. We enjoyed taking a step back from what it tries to teach you. We instead reflect on the broader lessons in the book about humans in general. There are many insights into our psychology, society, and how we can become a better version of ourselves without using others. \nThe book makes an interesting contrast to the next book all about Feminism, 'Invisible Women' which is a hugely insightful dive into so many things that are wrong with society. \n","subtitle":"Investigative reporter Neil Strauss chronicles his journey and encounters in the seduction community. An interesting tale into how our minds can be lead in seduction and the dangers of seeking the wrong things.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/9/9f3e21fa-6ea9-4422-a6e2-b1708002db68/cover.jpg?v=1","pubDate":"2020-04-08T19:00:00.000Z","enclosure":{"length":"47990117","type":"audio/mp3","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/9f3e21fa-6ea9-4422-a6e2-b1708002db68.mp3"}},{"title":"3. Robert Wright - Why Buddhism is True","description":"'Why Buddhism is True' looks at the science and philosophy of meditation and enlightenment. The author is a devout non-meditating anger prone evolutionary psychologist and writer.\nHe dives headlong into the world of meditation with surprising results. He explains why it works from an evolutionary standpoint. Using his wit and intellect the book makes very enjoyable and enlightening reading.\nThis was my favourite book on meditation. I loved it so much that I wrote over 40 pages of notes during reading it.  (and yes I've read the other Sam Harris' book 'Waking Up' and most of the best ones)\nAbout\nRobert Wright famously explained in The Moral Animal how evolution shaped the human brain. The mind is designed to often delude us, he argued, about ourselves and about the world. And it is designed to make happiness hard to sustain.\nBut if we know our minds are rigged for anxiety, depression, anger, and greed, what do we do? Wright locates the answer in Buddhism, which figured out thousands of years ago what scientists are only discovering now. Buddhism holds that human suffering is a result of not seeing the world clearly—and proposes that seeing the world more clearly, through meditation, will make us better, happier people.\nIn Why Buddhism is True, Wright leads readers on a journey through psychology, philosophy, and a great many silent retreats to show how and why meditation can serve as the foundation for a spiritual life in a secular age. At once excitingly ambitious and wittily accessible, this is the first book to combine evolutionary psychology with cutting-edge neuroscience to defend the radical claims at the heart of Buddhist philosophy. With bracing honesty and fierce wisdom, it will persuade you not just that Buddhism is true—which is to say, a way out of our delusion—but that it can ultimately save us from ourselves, as individuals and as a species.\nhttps://www.goodreads.com/book/show/32895535-why-buddhism-is-true \n","subtitle":"The Science and Philosophy of Meditation and Enlightenment","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/5/59237c6a-ca66-453f-a6f7-0a3c7eaa81cb/cover.jpg?v=1","pubDate":"2020-03-31T13:00:00.000Z","enclosure":{"length":"73374450","type":"audio/mp3","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/59237c6a-ca66-453f-a6f7-0a3c7eaa81cb.mp3"}},{"title":"2. The Elephant in the Brain - Kevin Simler & Robin Hanson","description":"About the Book\nThe aim of \"Elephant in the Brain\" is to confront our hidden motives directly — to track down the darker, unexamined corners of our psyches and blast them with floodlights. Then, once our minds are more clearly visible, we can work to better understand human nature: Why do people laugh? Why are artists sexy? Why do we brag about travel? Why do we prefer to speak rather than listen?\nHuman beings are primates, and primates are political animals. Our brains are therefore designed not just to hunt and gather, but also to get ahead socially, often by devious means.\nBut while we may be self-interested schemers, we benefit by pretending otherwise. The less we know about our own ugly motives, the better. And thus we don’t like to talk — or even think — about the extent of our selfishness. This is “the elephant in the brain,” an introspective blind spot that makes it hard to think clearly about ourselves and the explanations for our behavior.\nWhat We Give\nA summary of the key ways human beings lie to themselves and others without even realising. There are so many hidden ways we conceal the truth to protect and advance ourselves. But sometimes to our detriment.\nWe work out the useful take-home point and consider the knowledge that is perhaps dangerous. \n","subtitle":"A summary of the key ways human beings lie to themselves and others without even realising. There are so many hidden ways we conceal the truth to protect and advance ourselves. But sometimes to our detriment. \r\nWe work out the useful take-home point and consider the knowledge that is perhaps dangerous.","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/2/25c814a8-1390-4721-860f-e1db5825f9ae/cover.jpg?v=2","pubDate":"2020-03-17T12:00:00.000Z","enclosure":{"length":"79253408","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/25c814a8-1390-4721-860f-e1db5825f9ae.mp3"}},{"title":"1. Introduction - The Big Plan","description":"This is a simple episode where we hear about what the plans are for the show.\nSam and Nico introduce each other and discuss some of their backgrounds if you want to get to know you lovely show hosts. \n","subtitle":"A short episode about the podcast and the show hosts if you want to know more about the show","imageURL":"https://assets.fireside.fm/file/fireside-images/podcasts/images/d/d3528bcf-c67a-4a54-904d-20535ecdd335/episodes/c/c85b6827-5c34-4027-8e6d-bcdbafe0abc6/cover.jpg?v=1","pubDate":"2020-03-05T13:00:00.000Z","enclosure":{"length":"22785129","type":"audio/mpeg","url":"https://aphid.fireside.fm/d/1437767933/d3528bcf-c67a-4a54-904d-20535ecdd335/c85b6827-5c34-4027-8e6d-bcdbafe0abc6.mp3"}}]}